[
  {
    "ISBN-13": 9780486402581,
    "Google Books ID": "cDY-joeCGoIC",
    "Reading List ID": "",
    "Title": "Combinatorial Optimization",
    "Subtitle": "Algorithms and Complexity",
    "Authors": "Papadimitriou, Christos H.; Steiglitz, Kenneth",
    "Page Count": 496,
    "Publication Date": "",
    "Publisher": "Courier Corporation",
    "Description": "This clearly written, mathematically rigorous text includes a novel algorithmic exposition of the simplex method and also discusses the Soviet ellipsoid algorithm for linear programming; efficient algorithms for network flow, matching, spanning trees, and matroids; the theory of NP-complete problems; approximation algorithms, local search heuristics for NP-complete problems, more. All chapters are supplemented by thought-provoking problems. A useful work for graduate-level students with backgrounds in computer science, operations research, and electrical engineering. \"Mathematicians wishing a self-contained introduction need look no further.\" — American Mathematical Monthly.",
    "Subjects": "Combinatorics; Mathematics",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780201038064,
    "Google Books ID": "iOWePwAACAAJ",
    "Reading List ID": "",
    "Title": "The Art of Computer Programming",
    "Subtitle": "Combinatorial Algorithms, Volume 4B",
    "Authors": "Knuth, Donald",
    "Page Count": 736,
    "Publication Date": "",
    "Publisher": "Addison-Wesley",
    "Description": "The Art of Computer Programming is Knuth's multivolume analysis of algorithms. With the addition of this new volume, it continues to be the definitive description of classical computer science.\n\nVolume 4B, the sequel to Volume 4A, extends Knuth's exploration of combinatorial algorithms. These algorithms are of keen interest to software designers because \". . . a single good idea can save years or even centuries of computer time.\"\n\nThe book begins with coverage of Backtrack Programming, together with a set of data structures whose links perform \"delightful dances\" and are ideally suited to this domain. New techniques for important applications such as optimum partitioning and layout are thereby developed.\n\nKnuth's writing is playful, and he includes dozens of puzzles to illustrate the algorithms and techniques, ranging from popular classics like edge-matching to more recent crazes like sudoku. Recreational mathematicians and computer scientists will not be disappointed!\n\nIn the second half of the book, Knuth addresses Satisfiability, one of the most fundamental problems in all of computer science. Innovative techniques developed at the beginning of the twenty-first century have led to game-changing applications, for such things as optimum scheduling, circuit design, and hardware verification. Thanks to these tools, computers are able to solve practical problems involving millions of variables that only a few years ago were regarded as hopeless.\n\nThe Mathematical Preliminaries Redux section of the book is a special treat, which presents basic techniques of probability theory that have become prominent since the original \"preliminaries\" were discussed in Volume 1.\n\nAs in every volume of this remarkable series, the book includes hundreds of exercises that employ Knuth's ingenious rating system, making it easy for readers of varying degrees of mathematical training to find challenges suitable to them. Detailed answers are provided to facilitate self-study.\n\n\"Professor Donald E. Knuth has always loved to solve problems. In Volume 4B he now promotes two brand new and practical general problem solvers, namely (0) the Dancing Links Backtracking and (1) the SAT Solver. To use them, a problem is defined declaratively (0) as a set of options, or (1) in Boolean formulae. Today's laptop computers, heavily armoured with very high speed processors and ultra large amounts of memory, are able to run either solver for problems having big input data. Each section of Volume 4B contains a multitudinous number of tough exercises which help make understanding surer. Happy reading!\" --Eiiti Wada, an elder computer scientist, UTokyo\n\n\"Donald Knuth may very well be a great master of the analysis of algorithms, but more than that, he is an incredible and tireless storyteller who always strikes the perfect balance between theory, practice, and fun. [Volume 4B, Combinatorial Algorithms, Part 2] dives deep into the fascinating exploration of search spaces (which is quite like looking for a needle in a haystack or, even harder, to prove the absence of a needle in a haystack), where actions performed while moving forward must be meticulously undone when backtracking. It introduces us to the beauty of dancing links for removing and restoring the cells of a matrix in a dance which is both simple to implement and very efficient.\" --Christine Solnon, Department of Computer Science, INSA Lyon\n\nRegister your book for convenient access to downloads, updates, and/or corrections as they become available.",
    "Subjects": "Computers; Programming",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780486432274,
    "Google Books ID": "byF4Xb1QbvMC",
    "Reading List ID": "",
    "Title": "Nonlinear Programming",
    "Subtitle": "Analysis and Methods",
    "Authors": "Avriel, Mordecai",
    "Page Count": 512,
    "Publication Date": "",
    "Publisher": "Courier Corporation",
    "Description": "Comprehensive and complete, this overview provides a single-volume treatment of key algorithms and theories. The author provides clear explanations of all theoretical aspects, with rigorous proof of most results. The two-part treatment begins with the derivation of optimality conditions and discussions of convex programming, duality, generalized convexity, and analysis of selected nonlinear programs. The second part concerns techniques for numerical solutions and unconstrained optimization methods, and it presents commonly used algorithms for constrained nonlinear optimization problems. This graduate-level text requires no advanced mathematical background beyond elementary calculus, linear algebra, and real analysis. 1976 edition. 58 figures. 7 tables.",
    "Subjects": "Functional Analysis; Linear & Nonlinear Programming; Mathematics",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780143113454,
    "Google Books ID": "IlwwEAAAQBAJ",
    "Reading List ID": "",
    "Title": "Chaos",
    "Subtitle": "Making a New Science",
    "Authors": "Gleick, James",
    "Page Count": 384,
    "Publication Date": "",
    "Publisher": "Penguin",
    "Description": "The million-copy bestseller by National Book Award nominee and Pulitzer Prize finalist James Gleick—the author of Time Travel: A History—that reveals the science behind chaos theory\n\nA work of popular science in the tradition of Stephen Hawking and Carl Sagan, this 20th-anniversary edition of James Gleick’s groundbreaking bestseller Chaos introduces a whole new readership to chaos theory, one of the most significant waves of scientific knowledge in our time. From Edward Lorenz’s discovery of the Butterfly Effect, to Mitchell Feigenbaum’s calculation of a universal constant, to Benoit Mandelbrot’s concept of fractals, which created a new geometry of nature, Gleick’s engaging narrative focuses on the key figures whose genius converged to chart an innovative direction for science. In Chaos, Gleick makes the story of chaos theory not only fascinating but also accessible to beginners, and opens our eyes to a surprising new view of the universe.",
    "Subjects": "History; Physics; Science; System Theory",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780486284248,
    "Google Books ID": "qEgjAwAAQBAJ",
    "Reading List ID": "",
    "Title": "Concepts of Modern Mathematics",
    "Subtitle": "",
    "Authors": "Stewart, Ian",
    "Page Count": 339,
    "Publication Date": "",
    "Publisher": "Courier Corporation",
    "Description": "Some years ago, &quot;new math&quot; took the country's classrooms by storm. Based on the abstract, general style of mathematical exposition favored by research mathematicians, its goal was to teach students not just to manipulate numbers and formulas, but to grasp the underlying mathematical concepts. The result, at least at first, was a great deal of confusion among teachers, students, and parents. Since then, the negative aspects of &quot;new math&quot; have been eliminated and its positive elements assimilated into classroom instruction.\nIn this charming volume, a noted English mathematician uses humor and anecdote to illuminate the concepts underlying &quot;new math&quot;: groups, sets, subsets, topology, Boolean algebra, and more. According to Professor Stewart, an understanding of these concepts offers the best route to grasping the true nature of mathematics, in particular the power, beauty, and utility of pure mathematics. No advanced mathematical background is needed (a smattering of algebra, geometry, and trigonometry is helpful) to follow the author's lucid and thought-provoking discussions of such topics as functions, symmetry, axiomatics, counting, topology, hyperspace, linear algebra, real analysis, probability, computers, applications of modern mathematics, and much more.\nBy the time readers have finished this book, they'll have a much clearer grasp of how modern mathematicians look at figures, functions, and formulas and how a firm grasp of the ideas underlying &quot;new math&quot; leads toward a genuine comprehension of the nature of mathematics itself.",
    "Subjects": "Algebra; Counting & Numeration; Mathematics; Science",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780486247755,
    "Google Books ID": "rYuToT7vHbMC",
    "Reading List ID": "",
    "Title": "Introductory Graph Theory",
    "Subtitle": "",
    "Authors": "Chartrand, Gary",
    "Page Count": 294,
    "Publication Date": "",
    "Publisher": "Courier Corporation",
    "Description": "Graph theory is used today in the physical sciences, social sciences, computer science, and other areas. Introductory Graph Theory presents a nontechnical introduction to this exciting field in a clear, lively, and informative style.\nAuthor Gary Chartrand covers the important elementary topics of graph theory and its applications. In addition, he presents a large variety of proofs designed to strengthen mathematical techniques and offers challenging opportunities to have fun with mathematics.\nTen major topics ? profusely illustrated ? include: Mathematical Models, Elementary Concepts of Graph Theory, Transportation Problems, Connection Problems, Party Problems, Digraphs and Mathematical Models, Games and Puzzles, Graphs and Social Psychology, Planar Graphs and Coloring Problems, and Graphs and Other Mathematics.\nA useful Appendix covers Sets, Relations, Functions, and Proofs, and a section devoted to exercises ? with answers, hints, and solutions ? is especially valuable to anyone encountering graph theory for the first time.\nUndergraduate mathematics students at every level, puzzlists, and mathematical hobbyists will find well-organized coverage of the fundamentals of graph theory in this highly readable and thoroughly enjoyable book.",
    "Subjects": "Applied; Applied Sciences; Graphic Methods; Mathematics; Science",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780262028615,
    "Google Books ID": "LDfpBgAAQBAJ",
    "Reading List ID": "",
    "Title": "Brain Computation as Hierarchical Abstraction",
    "Subtitle": "",
    "Authors": "Ballard, Dana H.",
    "Page Count": 440,
    "Publication Date": "",
    "Publisher": "MIT Press",
    "Description": "The vast differences between the brain's neural circuitry and a computer's silicon circuitry might suggest that they have nothing in common. In fact, as Dana Ballard argues in this book, computational tools are essential for understanding brain function. Ballard shows that the hierarchical organization of the brain has many parallels with the hierarchical organization of computing; as in silicon computing, the complexities of brain computation can be dramatically simplified when its computation is factored into different levels of abstraction.\n\nDrawing on several decades of progress in computational neuroscience, together with recent results in Bayesian and reinforcement learning methodologies, Ballard factors the brain's principal computational issues in terms of their natural place in an overall hierarchy. Each of these factors leads to a fresh perspective. A neural level focuses on the basic forebrain functions and shows how processing demands dictate the extensive use of timing-based circuitry and an overall organization of tabular memories. An embodiment level organization works in reverse, making extensive use of multiplexing and on-demand processing to achieve fast parallel computation. An awareness level focuses on the brain's representations of emotion, attention and consciousness, showing that they can operate with great economy in the context of the neural and embodiment substrates.",
    "Subjects": "Computers; Data Modeling & Design; Data Science; Life Sciences; Neuroscience; Science",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780465092949,
    "Google Books ID": "YdSPswEACAAJ",
    "Reading List ID": "",
    "Title": "A World Without Time",
    "Subtitle": "The Forgotten Legacy of Godel and Einstein",
    "Authors": "Yourgrau, Palle",
    "Page Count": 224,
    "Publication Date": "",
    "Publisher": "Basic Books",
    "Description": "In 1942, the logician Kurt Godel and Albert Einstein became close friends; they walked to and from their offices every day, exchanging ideas about science, philosophy, politics, and the lost world of German science. By 1949, Godel had produced a remarkable proof: In any universe described by the Theory of Relativity, time cannot exist. Einstein endorsed this result reluctantly but he could find no way to refute it, since then, neither has anyone else. Yet cosmologists and philosophers alike have proceeded as if this discovery was never made. In A World Without Time, Palle Yourgrau sets out to restore Godel to his rightful place in history, telling the story of two magnificent minds put on the shelf by the scientific fashions of their day, and attempts to rescue the brilliant work they did together.",
    "Subjects": "Science",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780135172384,
    "Google Books ID": "QVA8ugEACAAJ",
    "Reading List ID": "",
    "Title": "Foundations of Deep Reinforcement Learning",
    "Subtitle": "Theory and Practice in Python",
    "Authors": "Graesser, Laura; Keng, Wah Loon",
    "Page Count": 379,
    "Publication Date": "",
    "Publisher": "Addison-Wesley",
    "Description": "In just a few years, deep reinforcement learning (DRL) systems such as DeepMinds DQN have yielded remarkable results. This hybrid approach to machine learning shares many similarities with human learning: its unsupervised self-learning, self-discovery of strategies, usage of memory, balance of exploration and exploitation, and its exceptional flexibility. Exciting in its own right, DRL may presage even more remarkable advances in general artificial intelligence.\nDeep Reinforcement Learning in Python: A Hands-On Introduction is the fastest and most accessible way to get started with DRL. The authors teach through practical hands-on examples presented with their advanced OpenAI Lab framework. While providing a solid theoretical overview, they emphasize building intuition for the theory, rather than a deep mathematical treatment of results. Coverage includes:  Components of an RL system, including environment and agents  Value-based algorithms: SARSA, Q-learning and extensions, offline learning  Policy-based algorithms: REINFORCE and extensions; comparisons with value-based techniques  Combined methods: Actor-Critic and extensions; scalability through async methods  Agent evaluation  Advanced and experimental techniques, and more   How to achieve breakthrough machine learning performance by combining deep neural networks with reinforcement learning  Reduces the learning curve by relying on the authors' OpenAI Lab framework: requires less upfront theory, math, and programming expertise  Provides well-designed, modularized, and tested code examples with complete experimental data sets to illuminate the underlying algorithms  Includes case studies, practical tips, definitions, and other aids to learning and mastery  Prepares readers for exciting future advances in artificial general intelligence   The accessible, hands-on, full-color tutorial for building practical deep reinforcement learning solutions   How to achieve breakthrough machine learning performance by combining deep neural networks with reinforcement learning  Reduces the learning curve by relying on the authors' OpenAI Lab framework: requires less upfront theory, math, and programming expertise  Provides well-designed, modularized, and tested code examples with complete experimental data sets to illuminate the underlying algorithms  Includes case studies, practical tips, definitions, and other aids to learning and mastery  Prepares readers for exciting future advances in artificial general intelligence",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780486240619,
    "Google Books ID": "QFw6DwAAQBAJ",
    "Reading List ID": "",
    "Title": "An Introduction to Information Theory",
    "Subtitle": "Symbols, Signals & Noise",
    "Authors": "Pierce, John Robinson",
    "Page Count": 305,
    "Publication Date": "",
    "Publisher": "Courier Corporation",
    "Description": "Behind the familiar surfaces of the telephone, radio, and television lies a sophisticated and intriguing body of knowledge known as information theory. This is the theory that has permeated the rapid development of all sorts of communication, from color television to the clear transmission of photographs from the vicinity of Jupiter. Even more revolutionary progress is expected in the future.\nTo give a solid introduction to this burgeoning field, J. R. Pierce has revised his well-received 1961 study of information theory for an up-to-date second edition. Beginning with the origins of the field, Dr. Pierce follows the brilliant formulations of Claude Shannon and describes such aspects of the subject as encoding and binary digits, entropy. language and meaning, efficient encoding , and the noisy channel. He then goes beyond the strict confines of the topic to explore the ways in which information theory relates to physics, cybernetics, psychology, and art. Mathematical formulas are introduced at the appropriate points for the benefit of serious students. A glossary of terms and an appendix on mathematical notation are provided to help the less mathematically sophisticated.\nJ. R. Pierce worked for many years at the Bell Telephone Laboratories, where he became Director of Research in Communications Principles. He is currently affiliated with the engineering department of the California Institute of Technology. While his background is impeccable, Dr. Pierce also possesses an engaging writing style that makes his book all the more welcome. An Introduction to Information Theory continues to be the most impressive non-technical account available and a fascinating introduction to the subject for laymen.\n&quot;An uncommonly good study. . . . Pierce's volume presents the most satisfying discussion to be found.&quot;? Scientific American.",
    "Subjects": "Computer Science; Computers; Mathematics; Physics; Probability & Statistics; Questions & Answers; Reference; Science",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780679724650,
    "Google Books ID": "P_xvDwAAQBAJ",
    "Reading List ID": "",
    "Title": "Beyond Good & Evil",
    "Subtitle": "Prelude to a Philosophy of the Future",
    "Authors": "Nietzsche, Friedrich",
    "Page Count": 288,
    "Publication Date": "",
    "Publisher": "Knopf Doubleday Publishing Group",
    "Description": "One of the most remarkable and influential books of the nineteenth century—Nietzsche's attempt to sum up his philosophy. \n\nIn nine parts the book is designed to give the reader a comprehensive idea of Nietzsche's thought and style:  they span \"The Prejudices of Philsophers,\" \"The Free Spirit,\" religion, morals, scholarship, \"Our Virtues,\" \"Peoples and Fatherlands,\" and \"What Is Noble,\" as well as epigrams and a concluding poem.\nThis translation by Walter Kaufmann has become the standard one, for accuracy and fidelity to the eccentricities and grace of the style of the original.  The translation is based on the only edition Nietzsche himself published, and all variant reading in later editions.  This volume offers an inclusive index of subjects and persons, as well as a running footnote commentary on the text.",
    "Subjects": "Criticism; Ethics & Moral Philosophy; Individual Philosophers; Philosophy",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780807014271,
    "Google Books ID": "F-Q_xGjWBi8C",
    "Reading List ID": "",
    "Title": "Man's Search for Meaning",
    "Subtitle": "",
    "Authors": "Frankl, Viktor E.",
    "Page Count": 192,
    "Publication Date": "",
    "Publisher": "Beacon Press",
    "Description": "A book for finding purpose and strength in times of great despair, the international best-seller is still just as relevant today as when it was first published.\n\n“This is a book I reread a lot . . . it gives me hope . . . it gives me a sense of strength.”\n—Anderson Cooper, Anderson Cooper 360/CNN\n\nThis seminal book, which has been called “one of the outstanding contributions to psychological thought” by Carl Rogers and “one of the great books of our time” by Harold Kushner, has been translated into more than fifty languages and sold over sixteen million copies. “An enduring work of survival literature,” according to the New York Times, Viktor Frankl’s riveting account of his time in the Nazi concentration camps, and his insightful exploration of the human will to find meaning in spite of the worst adversity, has offered solace and guidance to generations of readers since it was first published in 1946. At the heart of Frankl’s theory of logotherapy (from the Greek word for “meaning”) is a conviction that the primary human drive is not pleasure, as Freud maintained, but rather the discovery and pursuit of what the individual finds meaningful. Today, as new generations face new challenges and an ever more complex and uncertain world, Frankl’s classic work continues to inspire us all to find significance in the very act of living, in spite of all obstacles.\n\nA must-read companion to this classic work, a new, never-before-published work by Frankl entitled Yes to Life: In Spite of Everything, is now available in English.\n\nThis book was published with two different covers. Customers will be shipped the book with one of the available covers.",
    "Subjects": "20th Century; Existential; History; Holocaust; Judaism; Modern; Movements; Psychology; Religion",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780691018263,
    "Google Books ID": "FRCnDwAAQBAJ",
    "Reading List ID": "",
    "Title": "Collected Works of C.G. Jung, Volume 9 (Part 2)",
    "Subtitle": "Aion Researches Into the Phenomenology of the Self",
    "Authors": "Jung, C. G.",
    "Page Count": 360,
    "Publication Date": "",
    "Publisher": "Princeton University Press",
    "Description": "Aion, originally published in German in 1951, is one of the major works of Jung's later years. The central theme of the volume is the symbolic representation of the psychic totality through the concept of the Self, whose traditional historical equivalent is the figure of Christ. Jung demonstrates his thesis by an investigation of the Allegoria Christi, especially the fish symbol, but also of Gnostic and alchemical symbolism, which he treats as phenomena of cultural assimilation. The first four chapters, on the ego, the shadow, and the anima and animus, provide a valuable summation of these key concepts in Jung's system of psychology.",
    "Subjects": "Behaviorism; Jungian; Movements; Psychoanalysis; Psychology",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9781939311238,
    "Google Books ID": "hPW_vwEACAAJ",
    "Reading List ID": "",
    "Title": "Map and Territory",
    "Subtitle": "",
    "Authors": "Yudkowsky, Eliezer",
    "Page Count": 186,
    "Publication Date": "",
    "Publisher": "Machine Intelligence Research Institute",
    "Description": "When human brains try to do things, they can run into some very strange problems. Self-deception, confirmation bias, magical thinking-it sometimes seems our ingenuity is boundless when it comes to shooting ourselves in the foot.In Map and Territory, decision theorist Eliezer Yudkowsky asks what a \"martial art\" of rationality would look like, beginning with the basic fighting stance-the orientation toward the world that lets us get the most bang for our cognitive buck, that best positions us to understand and react to brains' strange acts of self-destruction.",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9781849967204,
    "Google Books ID": "fOVxcgAACAAJ",
    "Reading List ID": "",
    "Title": "The Algorithm Design Manual",
    "Subtitle": "",
    "Authors": "Skiena, Steven S",
    "Page Count": 730,
    "Publication Date": "",
    "Publisher": "Springer London",
    "Description": "Most professional programmers that I’ve encountered are not well prepared to tacklealgorithmdesignproblems.Thisisapity,becausethetechniquesofalgorithm design form one of the core practical technologies of computer science. Designing correct, e?cient, and implementable algorithms for real-world problems requires access to two distinct bodies of knowledge: • Techniques – Good algorithm designers understand several fundamental - gorithm design techniques, including data structures, dynamic programming, depth-?rst search, backtracking, and heuristics. Perhaps the single most - portantdesigntechniqueismodeling,theartofabstractingamessyreal-world application into a clean problem suitable for algorithmic attack. • Resources – Good algorithm designers stand on the shoulders of giants. Ratherthanlaboringfromscratchtoproduceanewalgorithmforeverytask, they can ?gure out what is known about a particular problem. Rather than re-implementing popular algorithms from scratch, they seek existing imp- mentations to serve as a starting point. They are familiar with many classic algorithmic problems, which provide su?cient source material to model most any application. This book is intended as a manual on algorithm design, providing access to combinatorial algorithm technology for both students and computer professionals.",
    "Subjects": "Algorithms; Computer Science; Computers; Data Science; Discrete Mathematics; Information Technology; Mathematics; Numerical Analysis; Programming; Software Development & Engineering",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9788122201475,
    "Google Books ID": "MAm0ZQvJAm0C",
    "Reading List ID": "",
    "Title": "Mensa Book Of Brain Teasers",
    "Subtitle": "",
    "Authors": "Wareham, Alan",
    "Page Count": 136,
    "Publication Date": "",
    "Publisher": "Orient Paperbacks",
    "Description": "Are you a genius? Could you qualify to join Mensa, the international society for high-IQ people? The only requirement for membership is to score in the top two per cent on a standard Mensa-supervised intelligence test. Members include persons who have never finished school and those with advanced degrees, from scientists and investors to housewives and students. MENSA BOOK OF BRAIN TEASERS presents puzzles and brain teasers similar to those used by Mensa in its intelligence tests. The puzzles are all graded from easy to very difficult, and, despite the occasional red herring, every one presents a fair challenge. Letter sequences, anagrams, logic boxes, power problems, hidden messages, magic squares and complex crosswords, all provide a thorough intellectual workout. Answers are given at the back of the book, and where necessary, explained. Find out if you are a Mensa genius. Attempt the puzzles in this book. Measure your score and rate your genius.",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780307389923,
    "Google Books ID": "-DyTEAAAQBAJ",
    "Reading List ID": "",
    "Title": "Incognito",
    "Subtitle": "The Secret Lives of the Brain",
    "Authors": "Eagleman, David",
    "Page Count": 304,
    "Publication Date": "",
    "Publisher": "Knopf Doubleday Publishing Group",
    "Description": "If the conscious mind--the part you consider to be you--is just the tip of the iceberg, what is the rest doing?\n\nIn this sparkling and provocative book, renowned neuroscientist David Eagleman navigates the depths of the subconscious brain to illuminate its surprising mysteries. Why can your foot move halfway to the brake pedal before you become consciously aware of danger ahead? Is there a true Mel Gibson? How is your brain like a conflicted democracy engaged in civil war? What do Odysseus and the subprime mortgage meltdown have in common? Why are people whose names begin with J more like to marry other people whose names begin with J? And why is it so difficult to keep a secret?\n\nTaking in brain damage, plane spotting, dating, drugs, beauty, infidelity, synesthesia, criminal law, artificial intelligence, and visual illusions, Incognito is a thrilling subsurface exploration of the mind and all its contradictions.",
    "Subjects": "Cognitive Psychology & Cognition; Criminal Law; Law; Neuropsychology; Psychology",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780465085989,
    "Google Books ID": "XQ3XswEACAAJ",
    "Reading List ID": "",
    "Title": "In Pursuit of the Unknown",
    "Subtitle": "17 Equations That Changed the World",
    "Authors": "Stewart, Ian",
    "Page Count": 360,
    "Publication Date": "",
    "Publisher": "Basic Books",
    "Description": "The seventeen equations that form the basis for life as we know it\nMost people are familiar with history's great equations: Newton's Law of Gravity, for instance, or Einstein's theory of relativity. But the way these mathematical breakthroughs have contributed to human progress is seldom appreciated. In In Pursuit of the Unknown, celebrated mathematician Ian Stewart untangles the roots of our most important mathematical statements to show that equations have long been a driving force behind nearly every aspect of our lives.\nUsing seventeen of our most crucial equations--including the Wave Equation that allowed engineers to measure a building's response to earthquakes, saving countless lives, and the Black-Scholes model, used by bankers to track the price of financial derivatives over time--Stewart illustrates that many of the advances we now take for granted were made possible by mathematical discoveries.\nAn approachable, lively, and informative guide to the mathematical building blocks of modern life, In Pursuit of the Unknown is a penetrating exploration of how we have also used equations to make sense of, and in turn influence, our world.",
    "Subjects": "Applied; Calculus; Computer Science; Computers; Education; Essays; History; History & Philosophy; Mathematics; Physics; Quantum Theory; Relativity; Science; Study & Teaching; Subjects; Teaching; Waves & Wave Mechanics",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780374535636,
    "Google Books ID": "wh3orQEACAAJ",
    "Reading List ID": "",
    "Title": "Things to Make and Do in the Fourth Dimension",
    "Subtitle": "A Mathematician's Journey Through Narcissistic Numbers, Optimal Dating Algorithms, at Least Two Kinds of Infinity, and More",
    "Authors": "Parker, Matt",
    "Page Count": 480,
    "Publication Date": "",
    "Publisher": "Farrar, Straus and Giroux",
    "Description": "A revolutionary book from the stand-up mathematician that makes math fun again—now in paperback!\n\n\nMath is boring, says the mathematician and comedian Matt Parker. Part of the problem may be the way the subject is taught, but it's also true that we all, to a greater or lesser extent, find math difficult and counterintuitive. This counterintuitiveness is actually part of the point, argues Parker: the extraordinary thing about math is that it allows us to access logic and ideas beyond what our brains can instinctively do—through its logical tools we are able to reach beyond our innate abilities and grasp more and more abstract concepts.\nIn the absorbing and exhilarating Things to Make and Do in the Fourth Dimension, Parker sets out to convince his readers to revisit the very math that put them off the subject as fourteen-year-olds. Starting with the foundations of math familiar from school (numbers, geometry, and algebra), he takes us on a grand tour, from four dimensional shapes, knot theory, the mysteries of prime numbers, optimization algorithms, and the math behind barcodes and iPhone screens to the different kinds of infinity—and slightly beyond.\nBoth playful and sophisticated, Things to Make and Do in the Fourth Dimension is filled with captivating games and puzzles, a buffet of optional hands-on activities that entice us to take pleasure in mathematics at all levels. Parker invites us to relearn much of what baffled us in school and, this time, to be utterly enthralled by it.",
    "Subjects": "Mathematics; Recreations & Games",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9781628731866,
    "Google Books ID": "QlqCDwAAQBAJ",
    "Reading List ID": "",
    "Title": "The Snark Handbook: Insult Edition",
    "Subtitle": "Comebacks, Taunts, and Effronteries",
    "Authors": "Dorfman, Lawrence",
    "Page Count": 192,
    "Publication Date": "",
    "Publisher": "Simon and Schuster",
    "Description": "The bestselling book on the art of the insult is back and it’s more blasphemous than ever. Author and snark connoisseur Lawrence Dorfman does his absolute worst, dishing out hundreds of clever insults for all situations and occasions. From careful instructions on how and when to throw a verbal punch to an expertly curated collection of the best insults in history, this uproarious little book has everything you need to become the ultimate slanderer. Every page is packed with delightfully mean one-liners for swiftly scorning your foes:\n\n“You’re not yourself today. I noticed the improvement immediately.”\n“You started at the bottom, and it’s been downhill ever since.”\n“His men would follow him anywhere but it was only out of morbid curiosity.”\n“Perhaps your whole purpose in life is simply to serve as a warning to others.”\n“You fill a much-needed gap.”\n\nComplete with charming black and white drawings that complement the book’s verbal spars, The Snark Handbook: Insult Edition proves that the pen truly is mightier than the sword, and will ensure you’re never again without the perfect quip or comeback.",
    "Subjects": "Anecdotes & Quotations; Business & Professional; Celebrity & Popular Culture; Form; History; Humor; Language; Puns & Wordplay; Quotations; Reference; Topic",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9788122201482,
    "Google Books ID": "WB8Go19ntmEC",
    "Reading List ID": "",
    "Title": "Mensa Book Of Logic Puzzles",
    "Subtitle": "",
    "Authors": "Wareman, Alan",
    "Page Count": 144,
    "Publication Date": "",
    "Publisher": "Orient Paperbacks",
    "Description": "Mensa is an international society for the high IQ people. Only two percent of the world's population qualifies for its membership. Mensa is a Latin word meaning 'table', implying a round table society where every member is equal. Mensa's policy is to include intelligent people of every opinion and background. Find out if you are mensa material. Accept the mensa challenge. Pick up a paper and pencil and attempt the puzzles in this book. A genius at work rarely does all the work in the head. Your age and academic qualifications do not matter. Neither does your profession. Members of Mensa include school dropouts and scientists, sports persons and housewives. You could be the next one to qualify, so get started!",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9781438298924,
    "Google Books ID": "Z5CNQQAACAAJ",
    "Reading List ID": "",
    "Title": "The Visual Guide to Extra Dimensions",
    "Subtitle": "Visualizing the Fourth Dimension, Higher-Dimensional Polytopes, and Curved Hypersurfaces",
    "Authors": "McMullen, Chris",
    "Page Count": 166,
    "Publication Date": "",
    "Publisher": "CreateSpace Independent Publishing Platform",
    "Description": "AUTHOR Chris McMullen earned his Ph.D. in particle physics from Oklahoma State University. Dr. McMullen currently teaches physics at Northwestern State University of Louisiana. His background on the geometry and physics of a possible fourth dimension of space includes a half-dozen research papers on the prospects of discovering large extra dimensions at the Large Hadron Collider.\n\nDESCRIPTION This book takes you on a visual tour of a fourth dimension of space. It is much more visual and conceptual than algebraic, yet it is detailed and technical, with the intention of satisfying the needs of mathematically-minded readers familiar with the fundamentals of algebra, geometry, and graphing. Here is a sample of what you will find:\nA fascinating tour of the second and lower dimensions, which will help to understand the fourth dimension by analogy.A chapter dedicated toward imagining what it might be like to live in a hypothetical 4D hyperuniverse. This includes details like 4D wheels with axles, a 4D staircase, and a 4D room.Pictures of flat 4D objects called polytopes, like the tesseract, pentachoron, and icositetrachoron. A unique graph of a hecatonicosachoron has 12 of its 120 bounding dodecahedra highlighted to help visualize its complicated structure.In-depth discussion of the hypercube, including numerical patterns, rotations, cross sections, and perspective. Watch a tesseract unfold.Visual intersections of 15 pairs of perpendicular planes and 6 pairs of orthogonal hyperplanes in 4D space.Unique graphs of curved hypersurfaces in 4D space, like the glome, spherinder, cubinder, and hyperparaboloid.\nPUZZLES Several puzzles are included to challenge the reader to contemplate the fourth dimension. Answers are included at the back of the book.\n\nAUDIENCE This book is highly visual and very conceptual such that anyone with an appreciation for geometry may understand it, while at the same time including ample detail to also satisfy readers with a strong background in mathematics.",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780814758014,
    "Google Books ID": "G29G3W_hNQkC",
    "Reading List ID": "",
    "Title": "Godel's Proof",
    "Subtitle": "",
    "Authors": "Nagel, Ernest; Newman, James R.",
    "Page Count": 160,
    "Publication Date": "",
    "Publisher": "NYU Press",
    "Description": "An accessible explanation of Kurt Gödel's groundbreaking work in mathematical logic\n\nIn 1931 Kurt Gödel published his fundamental paper, \"On Formally Undecidable Propositions of Principia Mathematica and Related Systems.\" This revolutionary paper challenged certain basic assumptions underlying much research in mathematics and logic. Gödel received public recognition of his work in 1951 when he was awarded the first Albert Einstein Award for achievement in the natural sciences—perhaps the highest award of its kind in the United States. The award committee described his work in mathematical logic as \"one of the greatest contributions to the sciences in recent times.\"\n\nHowever, few mathematicians of the time were equipped to understand the young scholar's complex proof. Ernest Nagel and James Newman provide a readable and accessible explanation to both scholars and non-specialists of the main ideas and broad implications of Gödel's discovery. It offers every educated person with a taste for logic and philosophy the chance to understand a previously difficult and inaccessible subject.\n\nNew York University Press is proud to publish this special edition of one of its bestselling books. With a new introduction by Douglas R. Hofstadter, this book will appeal students, scholars, and professionals in the fields of mathematics, computer science, logic and philosophy, and science.",
    "Subjects": "Logic; Mathematics",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9781626864221,
    "Google Books ID": "wCpZDwAAQBAJ",
    "Reading List ID": "",
    "Title": "How to Fight a Bear . . . and Win",
    "Subtitle": "& 72 Other Real Survival Tips We Hope You'll Never Need",
    "Authors": "Institute, Bathroom Readers'",
    "Page Count": 256,
    "Publication Date": "",
    "Publisher": "Simon and Schuster",
    "Description": "A humorous guide to surviving in the wilderness, that also might make you want to avoid the wilderness forever.\n\nFor more than twenty-five years, Uncle John’s Bathroom Reader has helped you learn amazing things you didn’t know. Now, Uncle John will show you how to do things you didn’t know how to do . . . and probably should never, never, never actually do, unless you’re in a survival situation and really, really, really need to do. It’s How to Fight a Bear . . . and Win. A new approach to survival guides and how-to books, this book provides step-by-step instructions for how to make do in any rugged terrain. But if you’re expecting “how to start a fire,” think again. This isn’t the kind of book that will tell you how to make a fire by rubbing two sticks together—it will tell you how to make a fire using a car battery. It will also tell you:\n\n·       How to swing from a vine like Tarzan\n\n·       How to land an airplane in an emergency\n\n·       How to fight a bear . . . and win\n\n·       How to perform emergency surgery in the woods\n\n·       How to identify what insects you can—and cannot—eat\n\nAnd lots, lots more",
    "Subjects": "Form; Humor; Personal & Practical Guides; Reference; Safety & Security; Self-Help; Survival & Emergency Preparedness; Trivia",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780140289206,
    "Google Books ID": "grzEQgAACAAJ",
    "Reading List ID": "",
    "Title": "Gödel, Escher, Bach",
    "Subtitle": "An Eternal Golden Braid",
    "Authors": "Hofstadter, Douglas R.",
    "Page Count": 777,
    "Publication Date": "",
    "Publisher": "Penguin",
    "Description": "'What is a self, and how can a self come out of inaminate matter?' This is the riddle that drove Hofstadter to write this extraordinary book. Linking together the music of J.S. Bach, the graphic art of Escher and the mathematical theorems of Godel, as well as ideas drawn from logic, biology, psychology, physics and linguistics, Douglas Hofstadter illuminates one of the greatest mysteries of modern science: the nature of human thought processes. 'Every few decades an unknown author brings outa book of such depth, clarity, range, wit, beauty and originality that it is recognized at once as a major literary event. This is such a work' - Martin Gardner",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9781888009187,
    "Google Books ID": "nc1UAAAAYAAJ",
    "Reading List ID": "",
    "Title": "Euclid's Elements",
    "Subtitle": "All Thirteen Books Complete in One Volume : the Thomas L. Heath Translation",
    "Authors": "Euclid; Densmore, Dana",
    "Page Count": 499,
    "Publication Date": "",
    "Publisher": "Green Lion Press",
    "Description": "The classic Heath translation, in a completely new layout with plenty of space and generous margins. An affordable but sturdy sewn hardcover student and teacher edition in one volume, with minimal notes and a new index/glossary.",
    "Subjects": "Geometry; History & Philosophy; Mathematics; Number Theory",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780262194167,
    "Google Books ID": "_NYamXKkNM8C",
    "Reading List ID": "",
    "Title": "Advances in Kernel Methods",
    "Subtitle": "Support Vector Learning",
    "Authors": "Schölkopf, Bernhard; Burges, Christopher J. C.; Schölkopf, Director of the Max Planck Institute for Intelligent in Tübingen Germany Professor for Machine Lea Bernhard; C.), Burges (Christopher J.; Smola, Alexander J.",
    "Page Count": 376,
    "Publication Date": "",
    "Publisher": "MIT Press",
    "Description": "The Support Vector Machine is a powerful new learning algorithm for solving a variety of learning and function estimation problems, such as pattern recognition, regression estimation, and operator inversion. The impetus for this collection was a workshop on Support Vector Machines held at the 1997 NIPS conference. The contributors, both university researchers and engineers developing applications for the corporate world, form a Who's Who of this exciting new area.ContributorsPeter Bartlett, Kristin P. Bennett, Christopher J.C. Burges, Nello Cristianini, Alex Gammerman, Federico Girosi, Simon Haykin, Thorsten Joachims, Linda Kaufman, Jens Kohlmorgen, Ulrich Kreßel, Davide Mattera, Klaus-Robert Müller, Manfred Opper, Edgar E. Osuna, John C. Platt, Gunnar Rätsch, Bernhard Schölkopf, John Shawe-Taylor, Alexander J. Smola, Mark O. Stitson, Vladimir Vapnik, Volodya Vovk, Grace Wahba, Chris Watkins, Jason Weston, Robert C. Williamson",
    "Subjects": "Artificial Intelligence; Computers; Data Science; Neural Networks",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9788177588583,
    "Google Books ID": "vyhrriC6qcEC",
    "Reading List ID": "",
    "Title": "Programming Pearls",
    "Subtitle": "",
    "Authors": "Bentley, Jon Louis",
    "Page Count": 239,
    "Publication Date": "",
    "Publisher": "Pearson Education",
    "Description": "Offering advice for programmers at entry level, each chapter in this work discusses problems the programmer might face on any day, and suggests methods to get around them.",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780201924886,
    "Google Books ID": "umgPAQAAMAAJ",
    "Reading List ID": "",
    "Title": "Effective C++",
    "Subtitle": "50 Specific Ways to Improve Your Programs and Designs",
    "Authors": "Meyers, Scott",
    "Page Count": 256,
    "Publication Date": "",
    "Publisher": "Addison-Wesley",
    "Description": "This definitive guide to C++ has been updated to reflect the latest ANSI/ISO standard. With more than 50,000 copies sold, the first edition has helped thousands of developers improve their C++ programming skills. Continuing in this tradition, Meyers has reworked every item in the book and has liberally placed cross-references throughout the text.",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780190262129,
    "Google Books ID": "DfU0rgEACAAJ",
    "Reading List ID": "",
    "Title": "How to Build a Brain",
    "Subtitle": "A Neural Architecture for Biological Cognition",
    "Authors": "Eliasmith, Chris",
    "Page Count": 480,
    "Publication Date": "",
    "Publisher": "Oxford University Press",
    "Description": "One goal of researchers in neuroscience, psychology, and artificial intelligence is to build theoretical models that can explain the flexibility and adaptiveness of biological systems. How to Build a Brain provides a guided exploration of a new cognitive architecture that takes biological detail seriously while addressing cognitive phenomena. The Semantic Pointer Architecture (SPA) introduced in this book provides a set of tools for constructing a wide range of biologically constrained perceptual, cognitive, and motor models.\n\nExamples of such models are provided to explain a wide range of data including single-cell recordings, neural population activity, reaction times, error rates, choice behavior, and fMRI signals. Each of the models addressed in the book introduces a major feature of biological cognition, including semantics, syntax, control, learning, and memory. These models are presented as integrated considerations of brain function, giving rise to what is currently the world's largest functional brain model.\n\nThe book also compares the Semantic Pointer Architecture with the current state of the art, addressing issues of theory construction in the behavioral sciences, semantic compositionality, and scalability, among other considerations. The book concludes with a discussion of conceptual challenges raised by this architecture, and identifies several outstanding challenges for SPA and other cognitive architectures.\n\nAlong the way, the book considers neural coding, concept representation, neural dynamics, working memory, neuroanatomy, reinforcement learning, and spike-timing dependent plasticity. Eight detailed, hands-on tutorials exploiting the free Nengo neural simulation environment are also included, providing practical experience with the concepts and models presented throughout.",
    "Subjects": "Cognitive Psychology & Cognition; Medical; Neuroscience; Psychology",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9781732265189,
    "Google Books ID": "2ZQrxQEACAAJ",
    "Reading List ID": "",
    "Title": "An Elegant Puzzle",
    "Subtitle": "Systems of Engineering Management",
    "Authors": "Larson, Will",
    "Page Count": 288,
    "Publication Date": "",
    "Publisher": "Stripe Press",
    "Description": "A human-centric guide to solving complex problems in engineering management, from sizing teams to handling technical debt.\n\nThere's a saying that people don't leave companies, they leave managers. Management is a key part of any organization, yet the discipline is often self-taught and unstructured. Getting to the good solutions for complex management challenges can make the difference between fulfillment and frustration for teams--and, ultimately, between the success and failure of companies.\n\nWill Larson's An Elegant Puzzle focuses on the particular challenges of engineering management--from sizing teams to handling technical debt to performing succession planning--and provides a path to the good solutions. Drawing from his experience at Digg, Uber, and Stripe, Larson has developed a thoughtful approach to engineering management for leaders of all levels at companies of all sizes. An Elegant Puzzle balances structured principles and human-centric thinking to help any leader create more effective and rewarding organizations for engineers to thrive in.",
    "Subjects": "Computers; Project Management; Social Aspects; Software Development & Engineering; Technology & Engineering",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780615880990,
    "Google Books ID": "3AA4nwEACAAJ",
    "Reading List ID": "",
    "Title": "Coding the Matrix",
    "Subtitle": "Linear Algebra Through Applications to Computer Science",
    "Authors": "Klein, Philip N.",
    "Page Count": 535,
    "Publication Date": "",
    "Publisher": "Newtonian Press",
    "Description": "An engaging introduction to vectors and matrices and the algorithms that operate on them, intended for the student who knows how to program. Mathematical concepts and computational problems are motivated by applications in computer science. The reader learns by doing, writing programs to implement the mathematical concepts and using them to carry out tasks and explore the applications. Examples include: error-correcting codes, transformations in graphics, face detection, encryption and secret-sharing, integer factoring, removing perspective from an image, PageRank (Google's ranking algorithm), and cancer detection from cell features. A companion web site, codingthematrix.com provides data and support code. Most of the assignments can be auto-graded online. Over two hundred illustrations, including a selection of relevant xkcd comics.\n\nChapters: The Function, The Field, The Vector, The Vector Space, The Matrix, The Basis, Dimension, Gaussian Elimination, The Inner Product, Special Bases, The Singular Value Decomposition, The Eigenvector, The Linear Program",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780262013192,
    "Google Books ID": "7dzpHCHzNQ4C",
    "Reading List ID": "",
    "Title": "Probabilistic Graphical Models",
    "Subtitle": "Principles and Techniques",
    "Authors": "Koller, Daphne; Friedman, Nir",
    "Page Count": 1270,
    "Publication Date": "",
    "Publisher": "MIT Press",
    "Description": "A general framework for constructing and using probabilistic models of complex systems that would enable a computer to use available information for making decisions.\n\nMost tasks require a person or an automated system to reason—to reach conclusions based on available information. The framework of probabilistic graphical models, presented in this book, provides a general approach for this task. The approach is model-based, allowing interpretable models to be constructed and then manipulated by reasoning algorithms. These models can also be learned automatically from data, allowing the approach to be used in cases where manually constructing a model is difficult or even impossible. Because uncertainty is an inescapable aspect of most real-world applications, the book focuses on probabilistic models, which make the uncertainty explicit and provide models that are more faithful to reality.\n\nProbabilistic Graphical Models discusses a variety of models, spanning Bayesian networks, undirected Markov networks, discrete and continuous models, and extensions to deal with dynamical systems and relational data. For each class of models, the text describes the three fundamental cornerstones: representation, inference, and learning, presenting both basic concepts and advanced techniques. Finally, the book considers the use of the proposed framework for causal reasoning and decision making under uncertainty. The main text in each chapter provides the detailed technical development of the key ideas. Most chapters also include boxes with additional material: skill boxes, which describe techniques; case study boxes, which discuss empirical cases related to the approach described in the text, including applications in computer vision, robotics, natural language understanding, and computational biology; and concept boxes, which present significant concepts drawn from the material in the chapter. Instructors (and readers) can group chapters in various combinations, from core topics to more technically advanced material, to suit their particular needs.",
    "Subjects": "Artificial Intelligence; Computers",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780465018475,
    "Google Books ID": "92e30rzcoCkC",
    "Reading List ID": "",
    "Title": "Surfaces and Essences",
    "Subtitle": "Analogy as the Fuel and Fire of Thinking",
    "Authors": "Hofstadter, Douglas; Sander, Emmanuel",
    "Page Count": 592,
    "Publication Date": "",
    "Publisher": "Basic Books",
    "Description": "In a major new work from the author of Gdel, Escher, Bach and I Am a Strange Loop, two leading scholars argue that analogy is the basis for all human thoughts.",
    "Subjects": "Language; Philosophy; Philosophy & Social Aspects; Science",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780895792525,
    "Google Books ID": "EelcBAAAQBAJ",
    "Reading List ID": "",
    "Title": "3:16 Bible Texts Illuminated",
    "Subtitle": "",
    "Authors": "Knuth, Donald E.",
    "Page Count": 268,
    "Publication Date": "",
    "Publisher": "A-R Editions, Inc.",
    "Description": "What happens when a world-renowned computer scientist applies scientific methodology to studying the Bible, writes about his findings, and has some of the world's best calligraphers illustrate the work? The result is 3:16 Bible Texts Illuminated, a treasure of profound biblical insight and enchanting calligraphy that will enlighten your mind, your eyes, and your spirit. Donald E. Knuth so loved the Bible that he dedicated five years of his life to creating this masterpiece. With it, you will learn about each 3:16 verse of the Bible, how it came to be written, and how it contributes to the wholeness of the Bible. -- Publisher",
    "Subjects": "Christian Church; Religion",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780785830528,
    "Google Books ID": "JNOSmwEACAAJ",
    "Reading List ID": "",
    "Title": "The Code of the Samurai",
    "Subtitle": "",
    "Authors": "Nitobe, Inazo",
    "Page Count": 96,
    "Publication Date": "",
    "Publisher": "Chartwell Books",
    "Description": "Beautifully produced in traditional Chinese binding with a cloth cover and string, and with a timeless design, this book includes the classic Inazo text with a new introduction. It will appeal to anyone interested in leadership, the nobility of the Samurai and Japanese culture.\n\n\nBushido is the chivalric code of moral principles that the Samurai followed: rectitude, frugality, courage, benevolence, respect, honesty, honour and loyalty. Influenced by Confucianism, Shinto and Zen Buddhism, it tempers the violence of a warrior with wisdom and serenity. Alongside Sun Tzu’s The Art of War and Machiavelli’s The Prince, Inazo’s book has become influential among military and corporate leaders looking for ways to manage their people and overcome their opponents.\n\nThe term bushido was originally used in the 17th Century and came into common use around the world after the original publication of this book in 1899. In the tradition of the Kojiki, the Heike Monogatari, and The Book of Five Rings, this collection of principles sheds a great deal of clarity on the evolution of the Japanese Samurai culture.",
    "Subjects": "American; Asia; Asian American & Pacific Islander Studies; Ethnic Studies; History; Japan; Social Science",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780961392178,
    "Google Books ID": "v302PAAACAAJ",
    "Reading List ID": "",
    "Title": "Beautiful Evidence",
    "Subtitle": "",
    "Authors": "Tufte, Edward R.",
    "Page Count": 213,
    "Publication Date": "",
    "Publisher": "Graphics Press",
    "Description": "Science and art have in common intense seeing, the wide-eyed observing that generates empirical information. Beautiful Evidence is about how seeing turns into showing, how empirical observations turn into explanations and evidence presentations. The book identifies excellent and effective methods for presenting information, suggests new designs, and provides tools for assessing the credibility of evidence presentations.Here we will see many close readings of serious evidence presentations-ranging through evolutionary trees and rocket science to economics, art history, and sculpture. Insistent application of the principles of analytical thinking helps both insiders and outsiders assess the credibility of evidence.",
    "Subjects": "Computers; Games; Graphic Methods; Mathematics; Programming",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9788193245200,
    "Google Books ID": "JprzwAEACAAJ",
    "Reading List ID": "",
    "Title": "Coding Interview Questions",
    "Subtitle": "",
    "Authors": "Karumanchi, Narasimha",
    "Page Count": 520,
    "Publication Date": "",
    "Publisher": "CareerMonk Publications",
    "Description": "Table of Contents: goo.gl/jRCskB\nSample Chapter: goo.gl/aB0drj\nFound Issue? goo.gl/lzK72K\nVideos: goo.gl/BcHq74\n\n\"Coding Interview Questions\" is a book that presents interview questions in simple and straightforward manner with a clear-cut explanation. This book will provide an introduction to the basics. It comes handy as an interview and exam guide for computer scientists.\n\n\nTopics Covered:\n\n Programming Basics Introduction Recursion and Backtracking Linked Lists Stacks Queues Trees Priority Queue and Heaps Graph Algorithms Sorting Searching Selection Algorithms [Medians] Symbol Tables Hashing  String Algorithms  Algorithms Design Techniques  Greedy Algorithms  Divide and Conquer Algorithms  Dynamic Programming  Complexity Classes  Design Interview Questions  Operating System Concepts  Computer Networking Basics  Database Concepts  Brain Teasers  NonTechnical Help  Miscellaneous Concepts",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780984782864,
    "Google Books ID": "sFx8jgEACAAJ",
    "Reading List ID": "",
    "Title": "Cracking the Coding Interview, 6th Edition",
    "Subtitle": "189 Programming Questions and Solutions (Indian Edition)",
    "Authors": "McDowell, Gayle Laakmann",
    "Page Count": "",
    "Publication Date": "",
    "Publisher": "CareerCup",
    "Description": "",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780062509581,
    "Google Books ID": "ONitXxISTEEC",
    "Reading List ID": "",
    "Title": "The Essential Rumi - reissue",
    "Subtitle": "New Expanded Edition",
    "Authors": "Barks, Coleman",
    "Page Count": 416,
    "Publication Date": "",
    "Publisher": "Harper Collins",
    "Description": "From the premier interpreter of Rumi comes the first definitive one-volume collection of the enduringly popular spiritual poetry by the extraordinary thirteenth-century Sufi mystic.",
    "Subjects": "Comparative Religion; Middle Eastern; Poetry; Religion",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780262035613,
    "Google Books ID": "Np9SDQAAQBAJ",
    "Reading List ID": "",
    "Title": "Deep Learning",
    "Subtitle": "",
    "Authors": "Goodfellow, Ian; Bengio, Yoshua; Courville, Aaron",
    "Page Count": 800,
    "Publication Date": "",
    "Publisher": "MIT Press",
    "Description": "An introduction to a broad range of topics in deep learning, covering mathematical and conceptual background, deep learning techniques used in industry, and research perspectives.\n\n“Written by three experts in the field, Deep Learning is the only comprehensive book on the subject.”\n—Elon Musk, cochair of OpenAI; cofounder and CEO of Tesla and SpaceX\n\nDeep learning is a form of machine learning that enables computers to learn from experience and understand the world in terms of a hierarchy of concepts. Because the computer gathers knowledge from experience, there is no need for a human computer operator to formally specify all the knowledge that the computer needs. The hierarchy of concepts allows the computer to learn complicated concepts by building them out of simpler ones; a graph of these hierarchies would be many layers deep. This book introduces a broad range of topics in deep learning.\n\nThe text offers mathematical and conceptual background, covering relevant concepts in linear algebra, probability theory and information theory, numerical computation, and machine learning. It describes deep learning techniques used by practitioners in industry, including deep feedforward networks, regularization, optimization algorithms, convolutional networks, sequence modeling, and practical methodology; and it surveys such applications as natural language processing, speech recognition, computer vision, online recommendation systems, bioinformatics, and videogames. Finally, the book offers research perspectives, covering such theoretical topics as linear factor models, autoencoders, representation learning, structured probabilistic models, Monte Carlo methods, the partition function, approximate inference, and deep generative models.\n\nDeep Learning can be used by undergraduate or graduate students planning careers in either industry or research, and by software engineers who want to begin using deep learning in their products or platforms. A website offers supplementary material for both readers and instructors.",
    "Subjects": "Artificial Intelligence; Computer Science; Computers",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780198701811,
    "Google Books ID": "Sg8NBAAAQBAJ",
    "Reading List ID": "",
    "Title": "50 Visions of Mathematics",
    "Subtitle": "",
    "Authors": "Parc, Sam",
    "Page Count": 198,
    "Publication Date": "",
    "Publisher": "OUP Oxford",
    "Description": "Relax: no one understands technical mathematics without lengthy training but we all have an intuitive grasp of the ideas behind the symbols. To celebrate the 50th anniversary of the founding of the Institute of Mathematics and its Applications (IMA), this book is designed to showcase the beauty of mathematics - including images inspired by mathematical problems - together with its unreasonable effectiveness and applicability, without frying your brain. The book is a collection of 50 original essays contributed by a wide variety of authors. It contains articles by some of the best expositors of the subject (du Sautoy, Singh and Stewart for example) together with entertaining biographical pieces and articles of relevance to our everyday lives (such as Spiegelhalter on risk and Elwes on medical imaging). The topics covered are deliberately diverse and involve concepts from simple numerology to the very cutting edge of mathematics research. Each article is designed to be read in one sitting and to be accessible to a general audience. There is also other content. There are 50 pictorial 'visions of mathematics' which were supplied in response to an open call for contributions from IMA members, Plus readers and the worldwide mathematics community. You'll also find a series of \"proofs\" of Phythagoras's Theorem - mathematical, literary and comedy - after this, you'll never think of Pythagoras the same way again.",
    "Subjects": "Applied; Mathematics; Science",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780691015767,
    "Google Books ID": "nHKxDwAAQBAJ",
    "Reading List ID": "",
    "Title": "Jung on Active Imagination",
    "Subtitle": "",
    "Authors": "Jung, C. G.",
    "Page Count": 198,
    "Publication Date": "",
    "Publisher": "Princeton University Press",
    "Description": "All the creative art psychotherapies (art, dance, music, drama, poetry) can trace their roots to C. G. Jung's early work on active imagination. Joan Chodorow here offers a collection of Jung's writings on active imagination, gathered together for the first time. Jung developed this concept between the years 1913 and 1916, following his break with Freud. During this time, he was disoriented and experienced intense inner turmoil --he suffered from lethargy and fears, and his moods threatened to overwhelm him. Jung searched for a method to heal himself from within, and finally decided to engage with the impulses and images of his unconscious. It was through the rediscovery of the symbolic play of his childhood that Jung was able to reconnect with his creative spirit. In a 1925 seminar and again in his memoirs, he tells the remarkable story of his experiments during this time that led to his self-healing. Jung learned to develop an ongoing relationship with his lively creative spirit through the power of imagination and fantasies. He termed this therapeutic method \"active imagination.\"\n\n\nThis method is based on the natural healing function of the imagination, and its many expressions. Chodorow clearly presents the texts, and sets them in the proper context. She also interweaves her discussion of Jung's writings and ideas with contributions from Jungian authors and artists.",
    "Subjects": "Behaviorism; Movements; Psychoanalysis; Psychology; Reference",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9781786782274,
    "Google Books ID": "_viQEAAAQBAJ",
    "Reading List ID": "",
    "Title": "The New Secret Language of Symbols",
    "Subtitle": "An Illustrated Key to Unlocking Their Deep & Hidden Meanings",
    "Authors": "Fontana, David",
    "Page Count": 192,
    "Publication Date": "",
    "Publisher": "Watkins Media",
    "Description": "Unlock the secret meanings of the symbols that surround us.\n\nThe New Secret Language of Symbols is a beautifully illustrated sourcebook of symbols and symbol systems. An illuminating introduction looks at the cultural and psychological explanations of symbols - including the Jungian idea of the collective unconscious. Then follows \"The World of Symbols\", the heart of the book in which more than 500 symbols are presented and explained theme by theme - from the elemental symbolism of the cosmos to the multiplicity of meanings associated with manmade objects and structures. We learn, for example, about the various forms of dragon in myth, the symbolism of sacred geometry, the attributes of gods, goddesses, angels and mythic heroes, the array of associations ascribed to body parts, and the significance of such practical features as the anchor or the bridge. Interspersed with these thematic treatments are more than a dozen overviews of symbolrich cultures, religions, esoteric groups and symbol systems, ranging from ancient Egypt to the Tarot. Each overview is centred upon a major image that is decoded to expose its deeper, often cryptic, meanings - thereby giving the reader revealing insights into the thinking behind some of the world's most beautiful and intriguing art, artefacts and architecture.\n\nThroughout The New Secret Language of Symbols David Fontana has unpeeled layers of profound historical and psychological significance, probed the ancient roots of a vast range of symbols, and in the process - like a gifted archaeologist who knows exactly where to look and how to interpret what he finds - he has unearthed boundless treasures.",
    "Subjects": "Body, Mind & Spirit; Dreams; Inspiration & Personal Growth; Mysticism",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780892133338,
    "Google Books ID": "59IqPwAACAAJ",
    "Reading List ID": "",
    "Title": "Kṛṣṇa, the Supreme Personality of Godhead",
    "Subtitle": "A Summary Study of Śrīla Vyāsadeva's Śrīmad-Bhāgavatam, Tenth Canto",
    "Authors": "Prabhupāda, A. C. Bhaktivedanta Swami",
    "Page Count": 814,
    "Publication Date": "",
    "Publisher": "Bhaktivedanta Book Trust International",
    "Description": "For literally thousands of years, the Vedic literatures of India have represented a vast treasure house of knowledge and delight for millions of readrs. Unfortunately, many of the most interesting of these ancient Sanskrit texts have remained inaccessible to the modern reader in the West--that is, until now. This book contains an original account of the extraordinary pastrimes of Lord ?ri K???a, who appeared on this planet five thousand years ago. Absorb yourself in its pages and come directly in touch with His marvelous characteristics and glorious deeds. Join Lord K???a in a long-forgotten time as He enchants all the residents of the magical land of V?nd?vana and simultaneously battles a fantastic array of wizards and warriors wholly bent upon His destruction. ?ri K???a's pastimes are not only charming, fascinating and highly entertaining but are full of deep philosophical wisdom and spiritual insight as well. Anyone who takes the time to read this one-of-a-kind book will be impressed by its relevance to contemporary human concerns. In 1970, in anticipation of teh first printing of the book K???a, His Divine Grace A. C. Bhaktivedanta Swami Prabhup?da commented: \"No other religion has such a full concept of God. I think our K???a book will convince them. Whoever reads it will become a devotee of K???a.\"--",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780134397603,
    "Google Books ID": "ZPPxAQAACAAJ",
    "Reading List ID": "",
    "Title": "The art of computer programming",
    "Subtitle": "",
    "Authors": "Knuth, Donald Ervin",
    "Page Count": 310,
    "Publication Date": "",
    "Publisher": "Addison-Wesley",
    "Description": "",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780134671796,
    "Google Books ID": "_9MtvgAACAAJ",
    "Reading List ID": "",
    "Title": "The Art of Computer Programming, Volume 4, Fascicle 5",
    "Subtitle": "Mathematical Preliminaries Redux; Introduction to Backtracking; Dancing Links",
    "Authors": "Knuth, Donald E.",
    "Page Count": 320,
    "Publication Date": "",
    "Publisher": "Addison-Wesley",
    "Description": "This multivolume work on the analysis of algorithms has long been recognized as the definitive description of classical computer science. The four volumes published to date already comprise a unique and invaluable resource in programming theory and practice. Countless readers have spoken about the profound personal influence of Knuth's writings. Scientists have marveled at the beauty and elegance of his analysis, while practicing programmers have successfully applied his \"cookbook\" solutions to their day-to-day problems. All have admired Knuth for the breadth, clarity, accuracy, and good humor found in his books.\n\n\n\n\nTo continue the fourth and later volumes of the set, and to update parts of the existing volumes, Knuth has created a series of small books called fascicles, which are published at regular intervals. Each fascicle encompasses a section or more of wholly new or revised material. Ultimately, the content of these fascicles will be rolled up into the comprehensive, final versions of each volume, and the enormous undertaking that began in 1962 will be complete.\n\n\nThis fascicle covers three separate topics:\n\n  Mathematical Preliminaries. Knuth writes that this portion of fascicle 5 \"extends the 'Mathematical Preliminaries' of Section 1.2 in Volume 1 to things that I didn't know about in the 1960s. Most of this new material deals with probabilities and expectations of random events; there's also an introduction to the theory of martingales.\"   Backtracking: this section is the counterpart to section 7.2.1 which covered the generation of basic combinatorial patterns. This section covers non-basic patterns, ones where the developer needs to make tentative choices and then may need to backtrack when those choices need revision.   Dancing Links: this section is related to 2 above. It develops an important data structure technique that is suitable for backtrack programming described above.",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9781792644832,
    "Google Books ID": "K1uIxwEACAAJ",
    "Reading List ID": "",
    "Title": "Algorithms",
    "Subtitle": "",
    "Authors": "Erickson, Jeff",
    "Page Count": 449,
    "Publication Date": "",
    "Publisher": "Jeff Erickson.",
    "Description": "Algorithms are the lifeblood of computer science. They are the machines that proofs build and the music that programs play. Their history is as old as mathematics itself. This textbook is a wide-ranging, idiosyncratic treatise on the design and analysis of algorithms, covering several fundamental techniques, with an emphasis on intuition and the problem-solving process. The book includes important classical examples, hundreds of battle-tested exercises, far too many historical digressions, and exaclty four typos. Jeff Erickson is a computer science professor at the University of Illinois, Urbana-Champaign; this book is based on algorithms classes he has taught there since 1998.",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780132350884,
    "Google Books ID": "hjEFCAAAQBAJ",
    "Reading List ID": "",
    "Title": "Clean Code",
    "Subtitle": "A Handbook of Agile Software Craftsmanship",
    "Authors": "Martin, Robert C.",
    "Page Count": 431,
    "Publication Date": "",
    "Publisher": "Pearson Education",
    "Description": "Even bad code can function. But if code isn't clean, it can bring a development organization to its knees. Every year, countless hours and significant resources are lost because of poorly written code. But it doesn't have to be that way.\n\nNoted software expert Robert C. Martin presents a revolutionary paradigm with Clean Code: A Handbook of Agile Software Craftsmanship. Martin has teamed up with his colleagues from Object Mentor to distill their best agile practice of cleaning code \"on the fly\" into a book that will instill within you the values of a software craftsman and make you a better programmer--but only if you work at it.\n\nWhat kind of work will you be doing? You'll be reading code--lots of code. And you will be challenged to think about what's right about that code, and what's wrong with it. More importantly, you will be challenged to reassess your professional values and your commitment to your craft.\n\nClean Code is divided into three parts. The first describes the principles, patterns, and practices of writing clean code. The second part consists of several case studies of increasing complexity. Each case study is an exercise in cleaning up code--of transforming a code base that has some problems into one that is sound and efficient. The third part is the payoff: a single chapter containing a list of heuristics and \"smells\" gathered while creating the case studies. The result is a knowledge base that describes the way we think when we write, read, and clean code.\n\nReaders will come away from this book understanding\n How to tell the difference between good and bad code How to write good code and how to transform bad code into good code How to create good names, good functions, good objects, and good classes How to format code for maximum readability How to implement complete error handling without obscuring code logic How to unit test and practice test-driven development  This book is a must for any developer, software engineer, project manager, team lead, or systems analyst with an interest in producing better code.",
    "Subjects": "Computers; Software Development & Engineering",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780691150505,
    "Google Books ID": "PeYk3A1F8fUC",
    "Reading List ID": "",
    "Title": "Synchronicity",
    "Subtitle": "An Acausal Connecting Principle. (From Vol. 8. of the Collected Works of C. G. Jung) (New in Paper)",
    "Authors": "Jung, C. G.",
    "Page Count": 152,
    "Publication Date": "",
    "Publisher": "Princeton University Press",
    "Description": "Jung was intrigued from early in his career with coincidences, especially those surprising juxtapositions that scientific rationality could not adequately explain. He discussed these ideas with Albert Einstein before World War I, but first used the term \"synchronicity\" in a 1930 lecture, in reference to the unusual psychological insights generated from consulting the I Ching. A long correspondence and friendship with the Nobel Prize-winning physicist Wolfgang Pauli stimulated a final, mature statement of Jung's thinking on synchronicity, originally published in 1952 and reproduced here. Together with a wealth of historical and contemporary material, this essay describes an astrological experiment Jung conducted to test his theory. Synchronicity reveals the full extent of Jung's research into a wide range of psychic phenomena.\n\n\nThis paperback edition of Jung's classic work includes a new foreword by Sonu Shamdasani, Philemon Professor of Jung History at University College London.",
    "Subjects": "Body, Mind & Spirit; Jungian; Movements; Parapsychology; Psychoanalysis; Psychology",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9781789506518,
    "Google Books ID": "nBatwgEACAAJ",
    "Reading List ID": "",
    "Title": "Classical Mythology",
    "Subtitle": "Legends of the Ancient World",
    "Authors": "Publishing, Arcturus; Authors, Various",
    "Page Count": 336,
    "Publication Date": "",
    "Publisher": "Arcturus Publishing",
    "Description": "A stunning collection of myths and legends from Ancient Greece and Rome, retold by a variety of expert storytellers.",
    "Subjects": "Ancient; Folklore & Mythology; Greece; History; Rome; Social Science",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780155510050,
    "Google Books ID": "Z_QWnwEACAAJ",
    "Reading List ID": "",
    "Title": "Linear Algebra and Its Applications",
    "Subtitle": "",
    "Authors": "Strang, Gilbert",
    "Page Count": 505,
    "Publication Date": "",
    "Publisher": "Harcourt, Brace, Jovanovich, Publishers",
    "Description": "With a highly applied and computational focus, this book combines the important underlying theory with examples from electrical engineering, computer science, physics, biology and economics. An expanded list of computer codes in an appendix and more computer-solvable exercises in the text reflect Strang's interest in computational linear algebra. Many exercises appear in the sections and in the chapter reviews. Exercises are simple but instructive.",
    "Subjects": "Algebra; Linear; Mathematics",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780233005645,
    "Google Books ID": "Bkx2tgEACAAJ",
    "Reading List ID": "",
    "Title": "Leonardo Da Vinci",
    "Subtitle": "500 Years On: a Portrait of the Artist, Scientist and Innovator",
    "Authors": "Landrus, Matthew",
    "Page Count": 160,
    "Publication Date": "",
    "Publisher": "Carlton Books, Limited",
    "Description": "Painter. Inventor. Visionary. This complete guide examines the life and work of one of the greatest geniuses in history: Leonardo da Vinci.\n\nExplore the life of Leonardo da Vinci, from his childhood to his apprenticeship with Verrocchio, from the establishment of his own workshop in Florence to his painting of the Mona Lisa, and beyond. Packed with information about the great master's technique and style, Leonardo da Vinci features extracts from his notebooks and scientific studies, reproductions of his awe-inspiring paintings and sketches, and maps of where he lived. Smoothly integrating information on Leonardo the man with examinations of his inventions and renowned masterpieces, it's the perfect companion for aficionados of the incomparable artist.\n\nNew format of Treasures of Leonardo da Vinci",
    "Subjects": "Art; European; History; Individual Artists; Monographs; Renaissance",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9781628600834,
    "Google Books ID": "x4GQEAAAQBAJ",
    "Reading List ID": "",
    "Title": "Becoming a Supple Leopard 2nd Edition",
    "Subtitle": "The Ultimate Guide to Resolving Pain, Preventing Injury, and Optimizing Athletic Performance",
    "Authors": "Starrett, Kelly; Cordoza, Glen",
    "Page Count": 480,
    "Publication Date": "",
    "Publisher": "National Geographic Books",
    "Description": "Improve your athletic performance, extend your athletic career, treat stiffness and achy joints, and prevent and rehabilitate injuries—all without having to seek out a coach, doctor, chiropractor, physical therapist, or massage therapist. In Becoming a Supple Leopard, Dr. Kelly Starrett—founder of MobilityWOD.com—shares his revolutionary approach to mobility and maintenance of the human body and teaches you how to hack your own movement, allowing you to live a healthier, more fulfilling life.\n\nThis new edition of the New York Times and Wall Street Journal bestseller has been thoroughly revised to make it even easier to put to use. Want to truly understand the principles that guide human movement? Becoming a Supple Leopard lays out a blueprint for moving safely and effectively through life and sport. Want to learn how to apply those principles to specific movements, whether you are doing squats in the gym or picking up a bag of groceries? Hundreds of step-by-step photos show you not only how to perform a host of exercise movements, such the squat, deadlift, pushup, kettlebell swing, clean, snatch, and muscle-up, but also how to correct the common faults associated with those movements. Frustrated because you can’t perform a certain movement correctly due to range of motion restrictions? Breaking the body down into 14 distinct areas, Starrett demonstrates hundreds of mobilization techniques that will help you resolve restrictions and reclaim your mobility. Unsure how to put it all together into a program that addresses your individual needs? This updated edition lays out dozens of prescriptions that allow you to hone in on a specific limitation, a nagging injury, or an exercise fault that you just can’t seem to get right. It even offers a 14-day full-body mobility overhaul.\n\nPerformance is what drives us as human beings, but dysfunctional movement patterns can bring the human body to an abrupt halt. Often, the factors that impede performance are invisible even to seasoned athletes and coaches. Becoming a Supple Leopard makes the invisible visible. Whether you are a professional athlete, a weekend warrior, or simply someone wanting to live healthy and free from physical restrictions, this one-of-a-kind training manual will teach you how to harness your athletic potential and maintain your body. Learn how to perform basic maintenance on your body, unlock your athletic potential, live pain-free...and become a Supple Leopard. This step-by-step guide to movement and mobility will show you how to:\n\n• Move safely and efficiently in all situations\n\n• Organize your spine and joints in optimal, stable positions\n\n• Restore normal function to your joints and tissues\n\n• Accelerate recovery after training sessions and competition\n\n• Properly perform strength and conditioning movements like the squat, bench press, pushup, deadlift, clean, and snatch\n\n• Build efficient, transferable movement patterns and skill progressions from simple to more advanced exercises\n\n• Identify, diagnose, and correct inefficient movement patterns\n\n• Treat and resolve common symptoms like low back pain, carpal tunnel, shoulder pain, and tennis elbow\n\n• Prevent and rehabilitate common athletic injuries Use mobilization techniques to address short and stiff muscles, soft tissue and joint capsule restriction, motor control problems, and joint range of motion limitations\n\n• Create personalized mobility prescriptions to improve movement efficiency",
    "Subjects": "Bodybuilding & Weightlifting; Health & Fitness; Health & Safety; Pain Management; Sports & Recreation",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9781575863269,
    "Google Books ID": "Nj4eNgAACAAJ",
    "Reading List ID": "",
    "Title": "Things a Computer Scientist Rarely Talks about",
    "Subtitle": "",
    "Authors": "Knuth, Donald Ervin",
    "Page Count": 257,
    "Publication Date": "",
    "Publisher": "CSLI Publications",
    "Description": "In the fall of 1999, computer scientist Donald E. Knuth was invited to give six public lectures at MIT on the general subject of relations between faith and science. The lectures were broadcast live on the Internet and watched regularly by tens of thousands of people around the world, and they have remained popular many months after the event. This book contains transcripts of those lectures, edited and annotated by the author. After an introductory first lecture, the second one focusses on the interaction of randomization and religion, since randomization has become a key area of scientific interest during the past few decades. The third lecture considers questions of language translation, with many examples drawn from the author's experiments in which random verses of the Bible were analyzed in depth. The fourth lecture deals with art and aesthetics; it illustrates several ways in which beautiful presentations can greatly deepen our perception of difficult concepts. The fifth lecture discusses what the author learned from the \"3:16 project,\" a personal exploration of Biblical literature which he regards as a turning point in his own life. The sixth and final lecture, \"God and Computer Science,\" is largely independent of the other five. It deals with several new perspectives by which concepts of computer science help to shed light on many ancient and difficult questions previously addressed by scientists in other fields. A significant part of each lecture is devoted to spontaneous questions from the audience and the speaker's impromptu responses, transcribed from videotapes of the original sessions. The book concludes with a transcript of a panel discussion in which Knuth joins several other prominent computer specialists to discuss \"Creativity, Spirituality, and Computer Science.\" The other panelists are Guy L. Steele Jr. of Sun Microsystems, Manuela Veloso of Carnegie Mellon University, and Mitch Kapor of Lotus Development Corporation, together with moderator Harry Lewis (Dean of Harvard College). The book includes over 100 illustrations and photographs. The author has contributed additional notes and a comprehensive index. - Publisher.",
    "Subjects": "Computer Science; Computers",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780691058375,
    "Google Books ID": "KcrSDwAAQBAJ",
    "Reading List ID": "",
    "Title": "Jung on Synchronicity and the Paranormal",
    "Subtitle": "",
    "Authors": "Jung, C. G.",
    "Page Count": 177,
    "Publication Date": "",
    "Publisher": "Princeton University Press",
    "Description": "C. G. Jung had a lifelong interest in the paranormal that culminated in his influential theory of synchronicity. Combining extracts taken from the Collected Works; letters; the autobiographical Memories, Dreams, Reflections; and transcripts of seminars, Jung on Synchronicity and the Paranormal sets out clearly his seminal contribution to our understanding of this controversial area.\n\nIn his introduction, Roderick Main discusses Jung's encounters with and observations of the paranormal, the influences that contributed to his theory of synchronicity, and the central ideas of the theory itself. The selections include Jung's writings on mediumistic trance phenomena, spirits and hauntings, anomalous events in the development and practice of analytical psychology, and the divinatory techniques of astrology and the I Ching. The book also features Jung's most lucid account of his theory in the form of his short essay \"On Synchronicity,\" and a number of Jung's less-known writings on parapsychology, his astrological experiment, and the relationship between mind and body.\n\nJung on Synchronicity and the Paranormal addresses subjects that were fundamental to Jung's personal and professional development. Probing deeply into the theory of synchronicity, Roderick Main clarifies issues that have long been a source of confusion to Jung's readers.",
    "Subjects": "Body, Mind & Spirit; ESP (Clairvoyance, Precognition, Telepathy); Movements; Parapsychology; Psychoanalysis; Psychology; Reference",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780262521123,
    "Google Books ID": "7KkUAT_q_sQC",
    "Reading List ID": "",
    "Title": "Vehicles",
    "Subtitle": "Experiments in Synthetic Psychology",
    "Authors": "Braitenberg, Valentino",
    "Page Count": 168,
    "Publication Date": "",
    "Publisher": "MIT Press",
    "Description": "These imaginative thought experiments are the inventions of one of the world's eminent brain researchers.\n\nThese imaginative thought experiments are the inventions of one of the world's eminent brain researchers. They are \"vehicles,\" a series of hypothetical, self-operating machines that exhibit increasingly intricate if not always successful or civilized \"behavior.\" Each of the vehicles in the series incorporates the essential features of all the earlier models and along the way they come to embody aggression, love, logic, manifestations of foresight, concept formation, creative thinking, personality, and free will. In a section of extensive biological notes, Braitenberg locates many elements of his fantasy in current brain research.",
    "Subjects": "Cognitive Psychology & Cognition; Psychology",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780262535199,
    "Google Books ID": "ArtNEAAAQBAJ",
    "Reading List ID": "",
    "Title": "Drawing Physics",
    "Subtitle": "2,600 Years of Discovery From Thales to Higgs",
    "Authors": "Lemons, Don S.",
    "Page Count": 260,
    "Publication Date": "",
    "Publisher": "MIT Press",
    "Description": "Drawings and short essays offer engaging and accessible explanations of key ideas in physics, from triangulation to relativity and beyond.\n\nHumans have been trying to understand the physical universe since antiquity. Aristotle had one vision (the realm of the celestial spheres is perfect), and Einstein another (all motion is relativistic). More often than not, these different understandings begin with a simple drawing, a pre-mathematical picture of reality. Such drawings are a humble but effective tool of the physicist's craft, part of the tradition of thinking, teaching, and learning passed down through the centuries. This book uses drawings to help explain fifty-one key ideas of physics accessibly and engagingly. Don Lemons, a professor of physics and author of several physics books, pairs short, elegantly written essays with simple drawings that together convey important concepts from the history of physical science.\n\nLemons proceeds chronologically, beginning with Thales' discovery of triangulation, the Pythagorean monocord, and Archimedes' explanation of balance. He continues through Leonardo's description of “earthshine” (the ghostly glow between the horns of a crescent moon), Kepler's laws of planetary motion, and Newton's cradle (suspended steel balls demonstrating by their collisions that for every action there is always an equal and opposite reaction). Reaching the twentieth and twenty-first centuries, Lemons explains the photoelectric effect, the hydrogen atom, general relativity, the global greenhouse effect, Higgs boson, and more. The essays place the science of the drawings in historical context—describing, for example, Galileo's conflict with the Roman Catholic Church over his teaching that the sun is the center of the universe, the link between the discovery of electrical phenomena and the romanticism of William Wordsworth, and the shadow cast by the Great War over Einstein's discovery of relativity.\n\nReaders of Drawing Physics with little background in mathematics or physics will say, “Now I see, and now I understand.”",
    "Subjects": "History; Physics; Science",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780374538422,
    "Google Books ID": "l_LFvAEACAAJ",
    "Reading List ID": "",
    "Title": "When Einstein Walked with Gödel",
    "Subtitle": "Excursions to the Edge of Thought",
    "Authors": "Holt, Jim",
    "Page Count": 384,
    "Publication Date": "",
    "Publisher": "Farrar, Straus and Giroux",
    "Description": "From Jim Holt, the New York Times bestselling author of Why Does the World Exist?, comes an entertaining and accessible guide to the most profound scientific and mathematical ideas of recent centuries in When Einstein Walked with Gödel: Excursions to the Edge of Thought.\n\nDoes time exist? What is infinity? Why do mirrors reverse left and right but not up and down? In this scintillating collection, Holt explores the human mind, the cosmos, and the thinkers who’ve tried to encompass the latter with the former. With his trademark clarity and humor, Holt probes the mysteries of quantum mechanics, the quest for the foundations of mathematics, and the nature of logic and truth.\n\nAlong the way, he offers intimate biographical sketches of celebrated and neglected thinkers, from the physicist Emmy Noether to the computing pioneer Alan Turing and the discoverer of fractals, Benoit Mandelbrot. Holt offers a painless and playful introduction to many of our most beautiful but least understood ideas, from Einsteinian relativity to string theory, and also invites us to consider why the greatest logician of the twentieth century believed the U.S. Constitution contained a terrible contradiction—and whether the universe truly has a future.",
    "Subjects": "Cosmology; Essays; Mathematics; Philosophy; Science; Space Science",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780306812835,
    "Google Books ID": "QrLvswEACAAJ",
    "Reading List ID": "",
    "Title": "Structures",
    "Subtitle": "Or Why Things Don't Fall Down",
    "Authors": "Gordon, J. E.",
    "Page Count": 424,
    "Publication Date": "",
    "Publisher": "Da Capo Press",
    "Description": "In a book that Business Insider noted as one of the \"14 Books that inspired Elon Musk,\" J.E. Gordon strips engineering of its confusing technical terms, communicating its founding principles in accessible, witty prose.\n\nFor anyone who has ever wondered why suspension bridges don't collapse under eight lanes of traffic, how dams hold back--or give way under--thousands of gallons of water, or what principles guide the design of a skyscraper, a bias-cut dress, or a kangaroo, this book will ease your anxiety and answer your questions.\n\nStructures: Or Why Things Don't Fall Down is an informal explanation of the basic forces that hold together the ordinary and essential things of this world--from buildings and bodies to flying aircraft and eggshells. In a style that combines wit, a masterful command of his subject, and an encyclopedic range of reference, Gordon includes such chapters as \"How to Design a Worm\" and \"The Advantage of Being a Beam,\" offering humorous insights in human and natural creation.\n\nArchitects and engineers will appreciate the clear and cogent explanations of the concepts of stress, shear, torsion, fracture, and compression. If you're building a house, a sailboat, or a catapult, here is a handy tool for understanding the mechanics of joinery, floors, ceilings, hulls, masts--or flying buttresses.\n\nWithout jargon or oversimplification, Structures opens up the marvels of technology to anyone interested in the foundations of our everyday lives.",
    "Subjects": "Architecture; Physics; Reference; Science; Structural; Technology & Engineering",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780262640688,
    "Google Books ID": "LL74DwAAQBAJ",
    "Reading List ID": "",
    "Title": "The Elements of Computing Systems",
    "Subtitle": "Building a Modern Computer from First Principles",
    "Authors": "Nisan, Noam; Schocken, Shimon",
    "Page Count": 325,
    "Publication Date": "",
    "Publisher": "MIT Press",
    "Description": "A textbook with a hands-on approach that leads students through the gradual construction of a complete and working computer system including the hardware platform and the software hierarchy.\n\nIn the early days of computer science, the interactions of hardware, software, compilers, and operating system were simple enough to allow students to see an overall picture of how computers worked. With the increasing complexity of computer technology and the resulting specialization of knowledge, such clarity is often lost. Unlike other texts that cover only one aspect of the field, The Elements of Computing Systems gives students an integrated and rigorous picture of applied computer science, as its comes to play in the construction of a simple yet powerful computer system.\n\nIndeed, the best way to understand how computers work is to build one from scratch, and this textbook leads students through twelve chapters and projects that gradually build a basic hardware platform and a modern software hierarchy from the ground up. In the process, the students gain hands-on knowledge of hardware architecture, operating systems, programming languages, compilers, data structures, algorithms, and software engineering. Using this constructive approach, the book exposes a significant body of computer science knowledge and demonstrates how theoretical and applied techniques taught in other courses fit into the overall picture.\n\nDesigned to support one- or two-semester courses, the book is based on an abstraction-implementation paradigm; each chapter presents a key hardware or software abstraction, a proposed implementation that makes it concrete, and an actual project. The emerging computer system can be built by following the chapters, although this is only one option, since the projects are self-contained and can be done or skipped in any order. All the computer science knowledge necessary for completing the projects is embedded in the book, the only pre-requisite being a programming experience.\n\nThe book's web site provides all tools and materials necessary to build all the hardware and software systems described in the text, including two hundred test programs for the twelve projects. The projects and systems can be modified to meet various teaching needs, and all the supplied software is open-source.",
    "Subjects": "Computer Science; Computers",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780262526548,
    "Google Books ID": "xRgeBQAAQBAJ",
    "Reading List ID": "",
    "Title": "The Art of Insight in Science and Engineering",
    "Subtitle": "Mastering Complexity",
    "Authors": "Mahajan, Sanjoy",
    "Page Count": 408,
    "Publication Date": "",
    "Publisher": "MIT Press",
    "Description": "Tools to make hard problems easier to solve.\n\nIn this book, Sanjoy Mahajan shows us that the way to master complexity is through insight rather than precision. Precision can overwhelm us with information, whereas insight connects seemingly disparate pieces of information into a simple picture. Unlike computers, humans depend on insight. Based on the author's fifteen years of teaching at MIT, Cambridge University, and Olin College, The Art of Insight in Science and Engineering shows us how to build insight and find understanding, giving readers tools to help them solve any problem in science and engineering.\n\nTo master complexity, we can organize it or discard it. The Art of Insight in Science and Engineering first teaches the tools for organizing complexity, then distinguishes the two paths for discarding complexity: with and without loss of information. Questions and problems throughout the text help readers master and apply these groups of tools. Armed with this three-part toolchest, and without complicated mathematics, readers can estimate the flight range of birds and planes and the strength of chemical bonds, understand the physics of pianos and xylophones, and explain why skies are blue and sunsets are red.\n\nThe Art of Insight in Science and Engineering will appear in print and online under a Creative Commons Noncommercial Share Alike license.",
    "Subjects": "Applied; Applied Sciences; Engineering (General); Mathematics; Science; Technology & Engineering",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780892811380,
    "Google Books ID": "7OB8vwEACAAJ",
    "Reading List ID": "",
    "Title": "The Complete Illustrated Kama Sutra",
    "Subtitle": "",
    "Authors": "Dane, Lance",
    "Page Count": 320,
    "Publication Date": "",
    "Publisher": "Inner Traditions/Bear",
    "Description": "A fully illustrated Kama Sutra from the extraordinary and rare art collection of Lance Dane\n\n• The first complete translation to illustrate all 64 sexual postures described in the Kama Sutra\n\n• Includes 269 rare images\n\n• Composed by one of the world’s foremost scholars of the Kama Sutra and Indian art\n\nThe erotic sentiments described in the Hindu love classic the Kama Sutra constitute the most famous work on sex ever created. Written almost 2,000 years ago, the Kama Sutra deals with all aspects of sexual life, including the principles and techniques of sexual pleasure and how to best achieve ecstatic expression of life’s beauty.\n\nIn this complete and illustrated guide Lance Dane accompanies the Kama Sutra text with 269 illustrations and great works of art that encompass coins, palm leaf manuscripts, sculptures, ancient toys, jewelry, architecture, ivory combs, birch bark, cloth, paintings, frescoes, and scrolls. Gathered from museums and private collections around the world—as well as the author’s own collection of over 300,000 photographs—these rare images clearly illustrate all 64 sexual positions and the erotic instructions set forth in the Kama Sutra. The result is a dazzling and sensuous reading experience through which the teachings of the Kama Sutra spring to life.",
    "Subjects": "Human Sexuality; Personal Growth; Psychology; Religion; Self-Help; Sexual Instruction; Sexuality & Gender Studies",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9781930824003,
    "Google Books ID": "pP6wzQEACAAJ",
    "Reading List ID": "",
    "Title": "Seeing with Fresh Eyes",
    "Subtitle": "Meaning, Space, Data, Truth",
    "Authors": "Tufte, Edward",
    "Page Count": 176,
    "Publication Date": "",
    "Publisher": "Graphics Press",
    "Description": "Introduction: The Thinking Eye -- Meaning and Space: See with Fresh Eyes, Question Everything, Remodel Conventional Models -- Content-Responsive Typography: Redesigning Sentences, Paragraphs, Labels -- Graphical Sentences: Nouns and Verbs, Structure and Function -- Data Analysis when Truth Matters: On The Relationship Between Evidence and Conclusions. Remodeling Statistical Practice and Teaching -- Annotations: Explanatory Words, Numbers, Graphics, Images Placed on Content-Responsive Local Grids. Annotations are Hard to Unsee. Is Thinking Just Annotating the World? -- Instructions at Point of Need -- Lists: Theory and Practice -- Smarter and Shorter Meetings: Remodeling Nonfiction Presentations -- A Visual Index, a Quilt of Sources and Images: Remodeling the Back-Matter in Books.",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780955649493,
    "Google Books ID": "zcPwzgEACAAJ",
    "Reading List ID": "",
    "Title": "How to be a God",
    "Subtitle": "A Guide for Would-be Deities",
    "Authors": "Bartle, Richard A.",
    "Page Count": 528,
    "Publication Date": "",
    "Publisher": "NotByUs",
    "Description": "When it comes to questions concerning the nature of Reality, philosophers and theologians have the answers. Philsophers ahve the answers that can't be proven right. Theologians have the answers that can't be proven wrong. Today's designers of Massively-Multiplayer Online Role-Playing Games create realities for a living. They can't spend centuries mulling over the issues: they have to face them head-on. Their experiences can indate which theoretical proposals actually work in practice. That's today's designers. Tomorrow's will have a whole new set of questions to answer. The designers of virtual worlds are the literal gods of those realities. Suppose Artificial Intelligence comes through and allows us to create non-player characters as smart as us. What are our responsibilities as gods? How should we, as gods, conduct ourselves? How should we be gods?",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780877735892,
    "Google Books ID": "jE6PEAAAQBAJ",
    "Reading List ID": "",
    "Title": "Alchemical Active Imagination",
    "Subtitle": "Revised Edition",
    "Authors": "Franz, Marie-Louise von",
    "Page Count": 160,
    "Publication Date": "",
    "Publisher": "Shambhala",
    "Description": "A leading Jungian psychologist reveals the relationship between alchemy and analytical psychology, delving into the visionary work of a sixteenth-century alchemist\n\nAlthough alchemy is popularly regarded as the science that sought to transmute base physical matter, many of the medieval alchemists were more interested in developing a discipline that would lead to the psychological and spiritual transformation of the individual. C. G. Jung discovered in his study of alchemical texts a symbolic and imaginal language that expressed many of his own insights into psychological processes.\n\nIn this book, Marie-Louise von Franz examines a text by the sixteenth-century alchemist and physician Gerhard Dorn in order to show the relationship of alchemy to the concepts and techniques of analytical psychology. In particular, she shows that the alchemists practiced a kind of meditation similar to Jung's technique of active imagination, which enables one to dialogue with the unconscious archetypal elements in the psyche.\n\nOriginally delivered as a series of lectures at the C. G. Jung Institute in Zurich, the book opens therapeutic insights into the relations among spirit, soul, and body in the practice of active imagination.",
    "Subjects": "Alchemy; Body, Mind & Spirit; History; Jungian; Movements; Psychology",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9781680450323,
    "Google Books ID": "qtjhsgEACAAJ",
    "Reading List ID": "",
    "Title": "Best of Make: Volume 2",
    "Subtitle": "65 Projects and Skill Builders from the Pages of Make:",
    "Authors": "Make:, The Editors of",
    "Page Count": 392,
    "Publication Date": "",
    "Publisher": "Maker Media",
    "Description": "After ten years, Make: has become one of most celebrated magazines to hit the newsstands, and certainly one of the hottest reads. If you're just catching on to the Maker Movement and wonder what you've missed, this book contains the best projects and articles from the magazine. Find out what keeps Makers coming back to Make: with this assortment of DIY projects and articles selected by Make:'s editors. Learn to:\n\n Outfit your workshop and make some must-have tools Build electronic projects from actuators to antennae Make things with Arduino and Raspberry Pi Create drones and robots Build noisemaking projects and musical instruments Augment your photo and video capabilities Make your own food, soap, ink, and more",
    "Subjects": "Electronics; Experiments & Projects; Robotics; Science; Technology & Engineering",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780521199568,
    "Google Books ID": "jRGfhSoFx0oC",
    "Reading List ID": "",
    "Title": "Quantum Computing Since Democritus",
    "Subtitle": "",
    "Authors": "Aaronson, Scott",
    "Page Count": 370,
    "Publication Date": "",
    "Publisher": "Cambridge University Press",
    "Description": "Written by noted quantum computing theorist Scott Aaronson, this book takes readers on a tour through some of the deepest ideas of maths, computer science and physics. Full of insights, arguments and philosophical perspectives, the book covers an amazing array of topics. Beginning in antiquity with Democritus, it progresses through logic and set theory, computability and complexity theory, quantum computing, cryptography, the information content of quantum states and the interpretation of quantum mechanics. There are also extended discussions about time travel, Newcomb's Paradox, the anthropic principle and the views of Roger Penrose. Aaronson's informal style makes this fascinating book accessible to readers with scientific backgrounds, as well as students and researchers working in physics, computer science, mathematics and philosophy.",
    "Subjects": "Computer Science; Computers; Physics; Quantum Theory; Science",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9781577152033,
    "Google Books ID": "Zat9zgEACAAJ",
    "Reading List ID": "",
    "Title": "Astrology",
    "Subtitle": "Your Personal Guide",
    "Authors": "Bright, Steven",
    "Page Count": 160,
    "Publication Date": "",
    "Publisher": "Wellfleet Press",
    "Description": "",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": "",
    "Google Books ID": "tjKYoAEACAAJ",
    "Reading List ID": "",
    "Title": "Competitive Programming 3",
    "Subtitle": "The New Lower Bound of Programming Contests : Handbook for ACM ICPC and IOI Contestants",
    "Authors": "Halim, Steven; Halim, Felix",
    "Page Count": 423,
    "Publication Date": "",
    "Publisher": "Lulu.com",
    "Description": "",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9781732265172,
    "Google Books ID": "vKbpywEACAAJ",
    "Reading List ID": "",
    "Title": "The Art of Doing Science and Engineering",
    "Subtitle": "Learning to Learn",
    "Authors": "Hamming, Richard",
    "Page Count": 432,
    "Publication Date": "",
    "Publisher": "Stripe Matter Incorporated",
    "Description": "A groundbreaking treatise by one of the great mathematicians of our age, who outlines a style of thinking by which great ideas are conceived.\n\nWhat inspires and spurs on a great idea? Can we train ourselves to think in a way that will enable world-changing understandings and insights to emerge?\n\nRichard Hamming said we can. He first inspired a generation of engineers, scientists, and researchers in 1986 with \"You and Your Research,\" an electrifying sermon on why some scientists do great work, why most don't, why he did, and why you can--and should--too. The Art of Doing Science and Engineering is the full expression of what \"You and Your Research\" outlined. It's a book about thinking; more specifically, a style of thinking by which great ideas are conceived.\n\nThe book is filled with stories of great people performing mighty deeds--but they are not meant simply to be admired. Instead, they are to be aspired to, learned from, and surpassed. Hamming consistently returns to Shannon's information theory, Einstein's theory of relativity, Grace Hopper's work on high-level programming, Kaiser's work on digital fillers, and his own work on error-correcting codes. He also recounts a number of his spectacular failures as clear examples of what to avoid.\n\nOriginally published in 1996 and adapted from a course that Hamming taught at the US Naval Postgraduate School, this edition includes an all-new foreword by designer, engineer, and founder of Dynamicland Bret Victor, plus more than 70 redrawn graphs and charts.\n\nThe Art of Doing Science and Engineering is a reminder that a capacity for learning and creativity are accessible to everyone. Hamming was as much a teacher as a scientist, and having spent a lifetime forming and confirming a theory of great people and great ideas, he prepares the next generation for even greater distinction.",
    "Subjects": "Computer Science; Computers; Information Technology; Research; Technology & Engineering",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780465094622,
    "Google Books ID": "WK2wtAEACAAJ",
    "Reading List ID": "",
    "Title": "The Model Thinker",
    "Subtitle": "What You Need to Know to Make Data Work for You",
    "Authors": "Page, Scott E.",
    "Page Count": 448,
    "Publication Date": "",
    "Publisher": "Basic Books",
    "Description": "How anyone can become a data ninja\n\nFrom the stock market to genomics laboratories, census figures to marketing email blasts, we are awash with data. But as anyone who has ever opened up a spreadsheet packed with seemingly infinite lines of data knows, numbers aren't enough: we need to know how to make those numbers talk. In The Model Thinker, social scientist Scott E. Page shows us the mathematical, statistical, and computational models--from linear regression to random walks and far beyond--that can turn anyone into a genius. At the core of the book is Page's \"many-model paradigm,\" which shows the reader how to apply multiple models to organize the data, leading to wiser choices, more accurate predictions, and more robust designs. The Model Thinker provides a toolkit for business people, students, scientists, pollsters, and bloggers to make them better, clearer thinkers, able to leverage data and information to their advantage.",
    "Subjects": "Analysis & Trading Strategies; Baseball; Bayesian Analysis; Biostatistics; Business & Economics; Business Mathematics; Computers; Data Analytics; Data Modeling & Design; Data Science; Data Visualization; Econometrics; Economics; Education; Finance; Financial Engineering; Forecasting; Investments & Securities; Mathematical & Statistical Software; Mathematics; Medical; Multivariate Analysis; Numerical Analysis; Political Science; Probability & Statistics; Psychology; Public Affairs & Administration; Reference; Regression Analysis; Research; Research & Development; Social Science; Sports & Recreation; Statistics; Stochastic Processes; Technology & Engineering; Theory; Time Series",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780465030781,
    "Google Books ID": "SStFwf1H6j4C",
    "Reading List ID": "",
    "Title": "I Am a Strange Loop",
    "Subtitle": "",
    "Authors": "Hofstadter, Douglas R.",
    "Page Count": 412,
    "Publication Date": "",
    "Publisher": "Basic Books",
    "Description": "What do we mean when we say \"I\"? Can thought arise out of matter? Can a self, a soul, a consciousness, an \"I\" arise out of mere matter? If it cannot, then how can you or I be here? I Am a Strange Loop argues that the key to understanding selves and consciousness is the \"strange loop\"--a special kind of abstract feedback loop inhabiting our brains. Deep down, a human brain is a chaotic seething soup of particles, on a higher level it is a jungle of neurons, and on a yet higher level it is a network of abstractions that we call \"symbols.\" The most central and complex symbol in your brain or mine is the one we both call \"I.\" The \"I\" is the nexus in our brain where the levels feed back into each other and flip causality upside down, with symbols seeming to have free will and to have gained the paradoxical ability to push particles around, rather than the reverse. For each human being, this \"I\" seems to be the realest thing in the world. But how can such a mysterious abstraction be real--or is our \"I\" merely a convenient fiction? Does an \"I\" exert genuine power over the particles in our brain, or is it helplessly pushed around by the all-powerful laws of physics? These are the mysteries tackled in I Am a Strange Loop, Douglas R. Hofstadter's first book-length journey into philosophy since Godel, Escher, Bach. Compulsively readable and endlessly thought-provoking, this is the book Hofstadter's many readers have long been waiting for.",
    "Subjects": "Science",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9781119482086,
    "Google Books ID": "oU9KDwAAQBAJ",
    "Reading List ID": "",
    "Title": "Advances in Financial Machine Learning",
    "Subtitle": "",
    "Authors": "Prado, Marcos Lopez de",
    "Page Count": 400,
    "Publication Date": "",
    "Publisher": "John Wiley & Sons",
    "Description": "Learn to understand and implement the latest machine learning innovations to improve your investment performance\n\nMachine learning (ML) is changing virtually every aspect of our lives. Today, ML algorithms accomplish tasks that – until recently – only expert humans could perform. And finance is ripe for disruptive innovations that will transform how the following generations understand money and invest.\n\nIn the book, readers will learn how to:\n\n Structure big data in a way that is amenable to ML algorithms Conduct research with ML algorithms on big data Use supercomputing methods and back test their discoveries while avoiding false positives \n\nAdvances in Financial Machine Learning addresses real life problems faced by practitioners every day, and explains scientifically sound solutions using math, supported by code and examples. Readers become active users who can test the proposed solutions in their individual setting.\n\nWritten by a recognized expert and portfolio manager, this book will equip investment professionals with the groundbreaking tools needed to succeed in modern finance.",
    "Subjects": "Artificial Intelligence; Business & Economics; Computer Vision & Pattern Recognition; Computers; Investments & Securities; Machine Theory",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9781479274833,
    "Google Books ID": "y6FLBQAAQBAJ",
    "Reading List ID": "",
    "Title": "Elements of Programming Interviews",
    "Subtitle": "The Insiders' Guide",
    "Authors": "Aziz, Adnan; Lee, Tsung-Hsien; Prakash, Amit",
    "Page Count": 480,
    "Publication Date": "",
    "Publisher": "EPI",
    "Description": "The core of EPI is a collection of over 300 problems with detailed solutions, including 100 figures, 250 tested programs, and 150 variants. The problems are representative of questions asked at the leading software companies.\n\nThe book begins with a summary of the nontechnical aspects of interviewing, such as common mistakes, strategies for a great interview, perspectives from the other side of the table, tips on negotiating the best offer, and a guide to the best ways to use EPI.\n\nThe technical core of EPI is a sequence of chapters on basic and advanced data structures, searching, sorting, broad algorithmic principles, concurrency, and system design. Each chapter consists of a brief review, followed by a broad and thought-provoking series of problems. We include a summary of data structure, algorithm, and problem solving patterns.",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9781846146060,
    "Google Books ID": "KAjBXwAACAAJ",
    "Reading List ID": "",
    "Title": "Thinking, Fast and Slow",
    "Subtitle": "",
    "Authors": "Kahneman, Daniel",
    "Page Count": 499,
    "Publication Date": "",
    "Publisher": "Allen Lane",
    "Description": "Daniel Kahneman, recipient of the Nobel Prize in Economic Sciences for his seminal work in psychology challenging the rational model of judgement and decision-making, is one of the world's most important thinkers. His ideas have had a profound impact on many fields - including business, medicine and politics - but until now he has not brought together his many years of research in one book.\n\nIn Thinking, Fast and Slow, Kahneman takes us on a groundbreaking tour of the mind and explains the two systems that drive the way we think and make choices. One system is fast, intuitive, and emotional; the other is slower, more deliberative, and more logical. Kahneman exposes the extraordinary capabilities - and also the faults and biases - of fast thinking, and reveals the pervasive influence of intuitive impressions on our thoughts and behaviour. The importance of properly framing risks, the effects of cognitive biases on how we view others, the dangers of prediction, the right ways to develop skills, the pros and cons of fear and optimism, the difference between our experience and memory of events, the real components of happiness - each of these can be understood only by knowing how the two systems work together to shape our judgments and decisions.\n\nDrawing on a lifetime's experimental experience, Kahneman reveals where we can and cannot trust our intuitions and how we can tap into the benefits of slow thinking. He offers practical and enlightening insights into how choices are made in both our professional and our personal lives - and how we can use different techniques to guard against the mental glitches that often get us into trouble. Thinking, Fast and Slowwill transform the way you take decisions and experience the world.\n\n'There have been many good books on human rationality and irrationality, but only one masterpiece. That masterpiece is Daniel Kahneman's Thinking, Fast and Slow.' Financial Times\n\n'Thinking, Fast and Slowis a masterpiece - a brilliant and engaging intellectual saga by one of the greatest psychologists and deepest thinkers of our time. Kahneman should be parking a Pulitzer next to his Nobel Prize.' Daniel Gilbert, author of Stumbling on Happiness\n\n'Daniel Kahneman is one of the most original and interesting thinkers of our time. There may be no other person on the planet who better understands how and why we make the choices we make. In this absolutely amazing book, he shares a lifetime's worth of wisdom presented in a manner that is simple and engaging, but nonetheless stunningly profound. This book is a must read for anyone with a curious mind.' Steven D. Levitt, co-author of Freakonomics\n\n'Daniel Kahneman is among the most influential psychologists in history and certainly the most important psychologist alive today. He has a gift for uncovering remarkable features of the human mind, many of which have become textbook classics and part of the conventional wisdom. His work has reshaped social psychology, cognitive science, the study of reason and of happiness, and behavioral economics, a field that he and his collaborator Amos Tversky invented. The appearance of Thinking, Fast and Slowis a major event.' Steven Pinker, author of The Better Angels of our Nature\n\n'This is a landmark book in social thought, in the same league as The Wealth of Nationsby Adam Smith and The Interpretation of Dreamsby Sigmund Freud.' Nassim Nicholas Taleb, author of The Black Swan\n\n'This book is a tour de force by an intellectual giant; it is readable, wise, and deep. Buy it fast. Read it slowly and repeatedly. It will change the way you think, on the job, about the world, and in your own life.' Richard Thaler, co-author of",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780971732117,
    "Google Books ID": "4EW9oQEACAAJ",
    "Reading List ID": "",
    "Title": "Neural Network Design (2nd Edition)",
    "Subtitle": "",
    "Authors": "Hagan, Martin; Demuth, Howard; Beale, Mark; Jesus, Orlando De",
    "Page Count": 800,
    "Publication Date": "",
    "Publisher": "Martin Hagan",
    "Description": "This book, by the authors of the Neural Network Toolbox for MATLAB, provides a clear and detailed coverage of fundamental neural network architectures and learning rules. In it, the authors emphasize a coherent presentation of the principal neural networks, methods for training them and their applications to practical problems.FeaturesExtensive coverage of training methods for both feedforward networks (including multilayer and radial basis networks) and recurrent networks. In addition to conjugate gradient and Levenberg-Marquardt variations of the backpropagation algorithm, the text also covers Bayesian regularization and early stopping, which ensure the generalization ability of trained networks.Associative and competitive networks, including feature maps and learning vector quantization, are explained with simple building blocks.A chapter of practical training tips for function approximation, pattern recognition, clustering and prediction, along with five chapters presenting detailed real-world case studies.Detailed examples and numerous solved problems. Slides and comprehensive demonstration software can be downloaded from hagan.okstate.edu/nnd.html.",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780131856622,
    "Google Books ID": "wht-QgAACAAJ",
    "Reading List ID": "",
    "Title": "A First Course in Probability",
    "Subtitle": "",
    "Authors": "Ross, Sheldon M.",
    "Page Count": 565,
    "Publication Date": "",
    "Publisher": "Pearson Prentice Hall",
    "Description": "This introduction presents the mathematical theory of probability for readers in the fields of engineering and the sciences who possess knowledge of elementary calculus.Presents new examples and exercises throughout. Offers a new section that presents an elegant way of computing the moments of random variables defined as the number of events that occur. Gives applications to binomial, hypergeometric, and negative hypergeometric random variables, as well as random variables resulting from coupon collecting and match models. Provides additional results on inclusion-exclusion identity, Poisson paradigm, multinomial distribution, and bivariate normal distributionA useful reference for engineering and science professionals.",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9781107619197,
    "Google Books ID": "_o8IjwEACAAJ",
    "Reading List ID": "",
    "Title": "Quantum Computation and Quantum Information South Asian Edition",
    "Subtitle": "10th Anniversary Edition",
    "Authors": "Chuang, Isaac; Nielsen, Michael",
    "Page Count": 676,
    "Publication Date": "",
    "Publisher": "Cambridge University Press",
    "Description": "",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9781491962299,
    "Google Books ID": "I6qkDAEACAAJ",
    "Reading List ID": "",
    "Title": "Hands-On Machine Learning with Scikit-Learn and TensorFlow",
    "Subtitle": "Techniques and Tools to Build Learning Machines",
    "Authors": "Géron, Aurélien",
    "Page Count": 543,
    "Publication Date": "",
    "Publisher": "O'Reilly Media",
    "Description": "Graphics in this book are printed in black and white.\n\nThrough a series of recent breakthroughs, deep learning has boosted the entire field of machine learning. Now, even programmers who know close to nothing about this technology can use simple, efficient tools to implement programs capable of learning from data. This practical book shows you how.\n\nBy using concrete examples, minimal theory, and two production-ready Python frameworks--scikit-learn and TensorFlow--author Aurélien Géron helps you gain an intuitive understanding of the concepts and tools for building intelligent systems. You'll learn a range of techniques, starting with simple linear regression and progressing to deep neural networks. With exercises in each chapter to help you apply what you've learned, all you need is programming experience to get started.\n\n Explore the machine learning landscape, particularly neural nets Use scikit-learn to track an example machine-learning project end-to-end Explore several training models, including support vector machines, decision trees, random forests, and ensemble methods Use the TensorFlow library to build and train neural nets Dive into neural net architectures, including convolutional nets, recurrent nets, and deep reinforcement learning Learn techniques for training and scaling deep neural nets Apply practical code examples without acquiring excessive machine learning theory or algorithm details",
    "Subjects": "COMPUTERS; Computer Vision & Pattern Recognition; Computers; Data Processing; Intelligence (AI) & Semantics; Natural Language Processing; Neural Networks",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780465024759,
    "Google Books ID": "R133lQEACAAJ",
    "Reading List ID": "",
    "Title": "Fluid Concepts & Creative Analogies",
    "Subtitle": "Computer Models of the Fundamental Mechanisms of Thought",
    "Authors": "Hofstadter, Douglas R.; Group, Fluid Analogies Research",
    "Page Count": 528,
    "Publication Date": "",
    "Publisher": "Basic Books",
    "Description": "Readers of earlier works by Douglas Hofstadter will find this book a natural extension of his style and his ideas about creativity and analogy; in addition, psychologists, philosophers, and artificial-intelligence researchers will find in this elaborate web of ingenious ideas a deep and challenging new view of mind.",
    "Subjects": "Psychology",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780262039406,
    "Google Books ID": "V2B9DwAAQBAJ",
    "Reading List ID": "",
    "Title": "Foundations of Machine Learning, second edition",
    "Subtitle": "",
    "Authors": "Mohri, Mehryar; Rostamizadeh, Afshin; Talwalkar, Ameet",
    "Page Count": 504,
    "Publication Date": "",
    "Publisher": "MIT Press",
    "Description": "A new edition of a graduate-level machine learning textbook that focuses on the analysis and theory of algorithms.\n\nThis book is a general introduction to machine learning that can serve as a textbook for graduate students and a reference for researchers. It covers fundamental modern topics in machine learning while providing the theoretical basis and conceptual tools needed for the discussion and justification of algorithms. It also describes several key aspects of the application of these algorithms. The authors aim to present novel theoretical tools and concepts while giving concise proofs even for relatively advanced topics.\n\nFoundations of Machine Learning is unique in its focus on the analysis and theory of algorithms. The first four chapters lay the theoretical foundation for what follows; subsequent chapters are mostly self-contained. Topics covered include the Probably Approximately Correct (PAC) learning framework; generalization bounds based on Rademacher complexity and VC-dimension; Support Vector Machines (SVMs); kernel methods; boosting; on-line learning; multi-class classification; ranking; regression; algorithmic stability; dimensionality reduction; learning automata and languages; and reinforcement learning. Each chapter ends with a set of exercises. Appendixes provide additional material including concise probability review.\n\nThis second edition offers three new chapters, on model selection, maximum entropy models, and conditional entropy models. New material in the appendixes includes a major section on Fenchel duality, expanded coverage of concentration inequalities, and an entirely new entry on information theory. More than half of the exercises are new to this edition.",
    "Subjects": "Artificial Intelligence; Computers",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780136006633,
    "Google Books ID": "b7YMngEACAAJ",
    "Reading List ID": "",
    "Title": "Modern Operating Systems",
    "Subtitle": "",
    "Authors": "Tanenbaum, Andrew S.",
    "Page Count": 1076,
    "Publication Date": "",
    "Publisher": "Pearson Prentice Hall",
    "Description": "The widely anticipated revision of this worldwide best-seller incorporates the latest developments in operating systems technologies. The Third Edition includes up-to-date materials on relevant operating systems such as Linux, Windows, and embedded real-time and multimedia systems. Includes new and updated coverage of multimedia operating systems, multiprocessors, virtual machines, and antivirus software. Covers internal workings of Windows Vista (Ch. 11); unique even for current publications. Provides information on current research based Tanenbaum's experiences as an operating systems researcher. A useful reference for programmers.",
    "Subjects": "Computers; Operating Systems",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9788178087856,
    "Google Books ID": "yxDbXwAACAAJ",
    "Reading List ID": "",
    "Title": "Computer Networks",
    "Subtitle": "",
    "Authors": "Tanenbaum, Andrew S.",
    "Page Count": 891,
    "Publication Date": "",
    "Publisher": "Pearson Education",
    "Description": "",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780201477115,
    "Google Books ID": "LqzPMQEACAAJ",
    "Reading List ID": "",
    "Title": "Computer Networking",
    "Subtitle": "A Top-down Approach Featuring the Internet",
    "Authors": "Kurose, James F.; Ross, Keith W.",
    "Page Count": 712,
    "Publication Date": "",
    "Publisher": "Addison-Wesley",
    "Description": "Each Chapter concludes with Summary containing \"Homework Problems and Questions.\" Included are chapter review questions, problems, discussion questions, and assignments.) 1. Computer Networks and the Internet. What is the Internet? The Network Edge. Case History: Search for Extraterrestrial Life. The Network Core. Network Access and Physical Media. ISPs and Internet Backbones. Delay and Loss in Packet-Switched Networks. Protocol Layers and Their Service Models. History of Computer Networking and the Internet. 2. Application Layer. Principles of Application Layer Protocols. The Web and HTTP. File Transfer: FTP. Electronic Mail in the Internet. DNS-The Internet's Directory Service. Socket Programming with TCP. Socket Programming with UDP. Building a Simple Web Server. Content Distribution. 3. Transport Layer. Introduction and Transport-Layer Services. Multiplexing and Demultiplexing. Connectionless Transport: UDP. Principles of Reliable Data Transfer. Connection-Oriented Transport: TCP. Principles of Congestion Control. TCP Congestion Control. 4. Network Layer and Routing. Introduction and Network Service Models. Routing Principles. Hierarchical Routing. The Internet Protocol (IP). Routing in the Internet. What's Inside a Router? IPv6. Multicast Routing. Mobility and the Network Layer. 5 Link Layer and Local Area Networks. Data Link Layer: Introduction and Services. Error Detection and Correction Techniques. Multiple Access Protocols. LAN Addresses and ARP. Ethernet. Hubs, Bridges and Switches. Wireless Links. PPP: The Point-to-Point Protocol. Asynchronous Transfer Mode (ATM). Frame Relay. 6. Multimedia Networking. Multimedia Networking Applications. Streaming Stored Audio and Video. Making the Best of the Best-Effort Service: An Internet Phone Example. Protocols for Real-Time Interactive Applications. Beyond Best-Effort. Scheduling and Policing Me",
    "Subjects": "Computers; Networking",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780201634662,
    "Google Books ID": "_ZqIh0IbcrgC",
    "Reading List ID": "",
    "Title": "Firewalls and Internet Security",
    "Subtitle": "Repelling the Wily Hacker",
    "Authors": "Cheswick, William R.; Bellovin, Steven M.; Rubin, Aviel D.",
    "Page Count": 433,
    "Publication Date": "",
    "Publisher": "Addison-Wesley Professional",
    "Description": "Written by the people responsible for designing and maintaining AT&TUs Internet gateway, this is the definitive description and practical guide to protecting networks from hacker attacks. The book shows how to set up a \"firewall\" gateway--a dedicated computer equipped with safeguards that acts as a single, more easily defended Internet connection.",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780130322210,
    "Google Books ID": "fP1SAAAAMAAJ",
    "Reading List ID": "",
    "Title": "High-speed Networks and Internets",
    "Subtitle": "Performance and Quality of Service",
    "Authors": "Stallings, William",
    "Page Count": 715,
    "Publication Date": "",
    "Publisher": "Prentice Hall",
    "Description": "William Stallings offers the most comprehensive technical book to address a wide range of design issues of high-speed TCP/IP and ATM networks in print to date. \"High-Speed Networks and Internets\" presents both the professional and advanced student an up-to-date survey of key issues. The Companion Website and the author's Web page offer unmatched support for students and instructors. The book features the prominent use of figures and tables and an up-to-date bibliography.\n\nIn this second edition, this award-winning and best-selling author steps up to the leading edge of integrated coverage of key issues in the design of high-speed TCP/IP and ATM networks to include the following topics:  Unified coverage of integrated and differentiated services. Up-to-date and comprehensive coverage of TCP performance. Thorough coverage of next-generation Internet protocols including (RSVP), (MPLS), (RTP), and the use of Ipv6. Unified treatment of congestion in data networks; packet-switching, frame relay, ATM networks, and IP-based internets. Broad and detailed coverage of routing, unicast, and multicast. Comprehensive coverage of ATM; basic technology and the newest traffic control standards. Solid, easy-to-absorb mathematical background enabling understanding of the issues related to high-speed network performance and design. Up-to-date treatment of gigabit Ethernet. The first treatment of self-similar traffic for performance assessment in a textbook on networks (Explains the mathematics behind self-similar traffic and shows the performance implications and how to estimate performance parameters.)Up-to-date coverage of compression. (A comprehensive survey.) Coverage of gigabit networks. Gigabit design issues permeate the book.",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780070584082,
    "Google Books ID": "yLVBnwEACAAJ",
    "Reading List ID": "",
    "Title": "Data communications and networking",
    "Subtitle": "",
    "Authors": "Forouzan, Behrouz A.; Fegan, Sophia Chung",
    "Page Count": 1134,
    "Publication Date": "",
    "Publisher": "McGraw-Hill Higher Education",
    "Description": "",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9788120323810,
    "Google Books ID": "1qEzXwAACAAJ",
    "Reading List ID": "",
    "Title": "Wireless Communications: Principles And Practice 2Nd Ed.",
    "Subtitle": "",
    "Authors": "Rappaport, Theodore S.",
    "Page Count": 707,
    "Publication Date": "",
    "Publisher": "Prentice-Hall Of India Pvt. Limited",
    "Description": "",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9788177584257,
    "Google Books ID": "JVnBSzo49MYC",
    "Reading List ID": "",
    "Title": "Introduction to Computer Security",
    "Subtitle": "",
    "Authors": "Bishop",
    "Page Count": 616,
    "Publication Date": "",
    "Publisher": "Pearson Education",
    "Description": "",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9788120322134,
    "Google Books ID": "31FSPgAACAAJ",
    "Reading List ID": "",
    "Title": "Network Security: Private Communication In A Public World 2Nd Ed.",
    "Subtitle": "",
    "Authors": "Kaufman, Charlie",
    "Page Count": 712,
    "Publication Date": "",
    "Publisher": "Prentice-Hall Of India Pvt. Limited",
    "Description": "",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9788120311770,
    "Google Books ID": "pVQbPwAACAAJ",
    "Reading List ID": "",
    "Title": "Data Structures Using C and C++",
    "Subtitle": "",
    "Authors": "Langsam, Yedidyah; Augenstein, Moshe; Tenenbaum, Aaron M.",
    "Page Count": 672,
    "Publication Date": "",
    "Publisher": "Prentice-Hall of India",
    "Description": "An introduction to the fundamentals of data structures, this book explores abstract concepts and considers how those concepts are useful in problem solving. It explains how the abstractions can be made concrete by using a programming language, and shows how to use to C language for advance programming and how to develop the advanced features of C++. It features a wealth of tested and debugged working programs in C and C++.This text is designed for courses in data structures and programming.",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  },
  {
    "ISBN-13": 9780131873162,
    "Google Books ID": "sEwCT725lRgC",
    "Reading List ID": "",
    "Title": "Cryptography and Network Security",
    "Subtitle": "Principles and Practice",
    "Authors": "Stallings, William",
    "Page Count": 680,
    "Publication Date": "",
    "Publisher": "Prentice Hall",
    "Description": "For one-semester, undergraduate- or graduate-level courses in Cryptography, Computer Security, and Network Security.\n\nIn this age of viruses and hackers, of electronic eavesdropping and electronic fraud, security is paramount.\n\nAs the disciplines of cryptography and network security have matured, more practical, readily available applications to enforce network security have developed. This text provides a practical survey of both the principles and practice of cryptography and network security. First, the basic issues to be addressed by a network security capability are explored through a tutorial and survey of cryptography and network security technology. Then, the practice of network security is explored via practical applications that have been implemented and are in use today.\n\nVisit Stallings Companion Website at http://williamstallings.com/Crypto/Crypto4e.html for student and instructor resources and his Computer Science Student Resource site http://williamstallings.com/StudentSupport.html\n\nPassword protected instructor resources can be accessed here by clicking on the Resources Tab to view downloadable files. (Registration required)\n\nSupplements Include: Solutions, Power Point slides. Projects, Encryption Lab Exercises.",
    "Subjects": "",
    "Language Code": "en",
    "Started Reading": "",
    "Finished Reading": "",
    "Did Not Finish": "",
    "Current Page": "",
    "Current Percentage": "",
    "Rating": "",
    "Notes": "",
    "Lists": ""
  }
]